{
  "users": [
    {
      "id": "a76885c4-9792-401d-b69f-42ed35c5d123",
      "fullName": "carlos meneses",
      "username": "carlosmgs",
      "email": "carlos.meneses.g.s@gmail.com",
      "password": "$2a$10$2PBcyngvP0KBvCu8DWlHV.M4nQqrbDUZeFO06C/sMV9DHunQrCq7q",
      "description": "eae\n",
      "profileImage": null,
      "isActive": true,
      "createdAt": "2025-12-08T03:24:03.595Z",
      "updatedAt": "2025-12-08T03:38:21.756Z"
    },
    {
      "id": "f699d9ec-c69f-4894-8616-146959a7a518",
      "fullName": "carlos meneses",
      "username": "cmgs",
      "email": "carlos@gmail.com",
      "password": "$2a$10$egwbmeOZQFeIG4qR/lRCGO9SYQlaDwM9uY38ct4m0DClnDM.HbXIC",
      "description": null,
      "profileImage": null,
      "isActive": true,
      "createdAt": "2025-12-10T11:40:05.549Z",
      "updatedAt": "2025-12-10T11:40:05.549Z"
    }
  ],
  "documents": [
    {
      "id": "7b4fb0e4-1a7a-4862-8c00-01af53e2d9be",
      "userId": "a76885c4-9792-401d-b69f-42ed35c5d123",
      "originalName": "Adenosina.pdf",
      "storedName": "85148e34-3589-41bf-bbf2-b079fa11a528.pdf",
      "filePath": "uploads\\a76885c4-9792-401d-b69f-42ed35c5d123\\85148e34-3589-41bf-bbf2-b079fa11a528.pdf",
      "fileSize": 228131,
      "mimeType": "application/pdf",
      "status": "processed",
      "extractedText": "Formulário Terapêutico Distrital\n\n\n\nADENOSINA\nRaiane Diniz Oliveira\n\n1. APRESENTAÇÕES PADRONIZADAS E ACESSO\n\n4980 - Adenosina solução injetável 3 mg/ml ampola 2 ml – Uso hospitalar\n2. CLASSE TERAPÊUTICA\n1\n\nOutros preparados cardíacos\n3. INDICAÇÕES\n2\n\nTratamento da taquicardia paroxística supraventricular (TPSV) ao ritmo sinusal, incluindo a\nassociada à síndrome de Wolff-Parkinson-White, visando a reversão ao ritmo sinusal\n3.1 PROTOCOLO SES\nNão se aplica.\n3.2 PROTOCOLO MS\nNão se aplica.\n4. CONTRAINDICAÇÕES\n2,3,4\n\nEste medicamento e contraindicado para bloqueio atrioventricular de segundo e terceiro\ngraus (exceto em pacientes com marcapasso artificial funcionante); e doença do nó sinusial\nou bradicardia sintomática (exceto em pacientes com marcapasso artificial funcionante).\nAlém dessas, também são contraindicadas a pacientes que possuam hipersensibilidade à\nadenosina ou aos demais componentes da formulação e em doença pulmonar obstrutiva\nconhecida ou suspeita (ex: asma).\n5. ADMINISTRAÇÃO E USO\n2,3,4,5\n\n5.1 VIA DE ADMINISTRAÇÃO\nVia endovenosa (EV)\n\n5.2 MODO DE USO\nAdministração endovenosa direta com dose inicial de 6 mg em 1 a 2 s. Caso haja necessidade\nde uma ou duas administrações subsequentes, administrar com intervalo de 1 a 2 minutos\nentre elas. Não é recomendada a administração de doses únicas superiores a 12 mg.\n\nGOVERNO DO DISTRITO FEDERAL\nSECRETARIA DE ESTADO DE SAÚDE\nSUBSECRETARIA DE ATENÇÃO INTEGRAL À SAÚDE\nDIRETORIA DE ASSISTÊNCIA FARMACÊUTICA\n\n\nFormulário Terapêutico Distrital\nEste medicamento deve ser administrado em bolus endovenoso sem diluição, caso haja\nquantidade do medicamento não utilizada esta deve ser imediatamente descartada, uma vez\nque o medicamento não possui conservantes em sua fomulação .\n5.3 CARACTERÍSTICAS DA FORMULAÇÃO\n5.3.1 DISSOLUÇÃO (QUANDO APLICÁVEL) OU COMPATIBILIDADE (QUANDO APLICÁVEL)\nCompatível com SG 5%, SRL e SF 0,9%.\n5.3.2 TECNOLOGIAS DA FORMA FARMACÊUTICA (QUANDO APLICÁVEL)\nNão aplicável\n5.3.3 PROPRIEDADES FISICO-QUÍMICAS E ORGANOLÉPICAS\nA adenosina é um nucleosídeo endógeno presente em todas as células do organismo,\nquimicamente denominada 6-amino-9-beta-Dribofuranosila-9-H-purina, com peso molecular\n267,24 e fórmula empírica C10H13N5O4. A adenosina é um pó branco cristalino, solúvel em\nágua e praticamente insolúvel em álcool. Sua solubilidade aumenta com o aquecimento e a\ndiminuição do pH. A solução injetável é incolor e deve estar livre de partículas visíveis.\n5.4 DOSAGENS\n5.4.1 DOSE MÁXIMA\nDose inicial máxima de 6 mg e doses subsequentes de até 12 mg a cada administração.\n5.4.2 TITULAÇAO DE DOSE E DESMAME\nNão se aplica.\n5.5 RECOMENDAÇÕES DE SEGURANÇA\nNão se aplica.\n6. FARMACOLOGIA CLINICAMENTE RELEVANTE\n2,3,5\n\n6.1 FARMACODINÂMICA\n6.1.1 MECANISMO DE AÇÃO\nA adenosina atua hiperpolarizando os tecidos atriais, reduzindo a duração do potencial de\nação atrial e reduzindo, ainda, a fase de despolarização diastólica das células do nó\nsinoatrial. Dessa forma, retardando a condução através do nó atrioventricular (AV) e inibindo\na atividade refratária através do nó AV de maneira a restaurar o ritmo sinusal normal em\npacientes com TPSV.\n6.1.2 INÍCIO DA AÇÃO\nMedicamento de ação imediata.\n6.2 FARMACOCINÉTICA\n6.2.1 ABSORÇÃO\n BIODISPONIBILIDADE\nBiodisponibilidade endovenosa: 100%\n PICO DE CONCENTRAÇÃO PLASMÁTICA\n\n\nFormulário Terapêutico Distrital\nO pico de concentração plasmática da adenosina é considerado extremamente rápido,\numa vez que o farmáco possui meia-vida de aproximadamente 10 s.\n\n6.2.2 DISTRIBUIÇÃO\n LIGAÇÃO A PROTEÍNAS PLASMÁTICAS\nNão se aplica\n SOLUBILIDADE\nNão se aplica\n6.2.3 METABOLISMO\nA adenosina é desaminada em inosina e fosforilada em monofosfato de adenosina (AMP)\npelas enzimas adenosinodesaminase e adenosinoquinase respectivamente. A inosina pode\npermanecer inalterada ou degradada em hipoxantina, xantina e, eventualmente, ácido úrico.\nO AMP é adicionado ao pool de fosfato de alta energia.\n6.2.4 ELIMINAÇÃO\n MEIA-VIDA DE ELIMINAÇÃO\nA adenosina é eliminada em até 10 s.\n7. INTERAÇÕES MEDICAMENTOSAS\n2,3,4,5\n\n7.1 INTERAÇÃO MEDICAMENTO X MEDICAMENTO\n Carbamazepina: a carbamazepina aumenta o grau de bloqueio cardíaco produzido pela\nadenosina. Quando utilizada para tratamento de taquiarritmias supraventriculares em adultos,\nrecomenda-se a redução da dose inicial da adenosina.\n Digoxina: o uso concomitante à adenosina ou à adenosina e verapamil pode ocasionar\nfibrilação ventricular devido ao potencial sinérgico dos efeitos depressores destes agentes\nsobre os nós AS e AV. Recomenda-se a monitorização durante a terapia simultânea com\nambos os medicamentos.\n Dipiridamol: os efeitos vasoativos da adenosina são potencializados pelo uso\nconcomitante ao dipiridamol, sendo necessária a redução das doses iniciais da adenosina.\n Metilxantinas: as metilxantinas como teofilina e aminofilina exercem antagonismo\nfarmacodinâmico à adenosina. O seu efeito terapêutico é reduzido, doses mais altas de\nadenosina podem ser necessárias.\n7.2 INTERAÇÃO MEDICAMENTO X ALIMENTO\nCafeína: assim como outras metilxantinas, bebidas contendo cafeína podem exercer\nantagonismo farmacodinâmico à adenosina, reduzindo seu efeito terapêutico. Doses mais\naltas de adenosina podem ser necessárias.\n7.3 INTERAÇÃO MEDICAMENTO X EXAMES LABORATORIAIS\nNão se aplica\n8. EFEITOS ADVERSOS\n2,3,5\n\n\n\nFormulário Terapêutico Distrital\n8.1 GRAVES\nEste medicamento pode causar assistolia prolongada, taquicardia e fibrilação ventricular,\nbradicardia, fibrilação atrial, bloqueio atrioventricular total, insuficiência cardíaca e infarto\nagudo do miocárdio. Além desses, também são relatados broncoespasmo e parada\nrespiratória.\n8.2 COMUNS\nEste medicamento pode causar rubor facial, dispneia, desconforto gastrointestinal, náuseas,\ncefaleia, parestesia e tontura. Além desses, também são relatados dor no peito, hipotensão\ne palpitações.\n9. AJUSTES DE DOSE\n2,3,4,5\n\n9.1. INJURIA RENAL\n9.1.1 ADULTO\nNão há necessidade de ajuste de dose em relação a função renal.\n9.1.2 CRIANÇA E NEONATO\nNão se aplica\n9.1.3 HEMODIÁLISE\nNão se aplica\n9.2. INSUFICIÊNCIA HEPATICA\n9.2.1 ADULTO\nNão há necessidade de ajuste de dose em relação a função hepática.\n9.2.2 CRIANÇA E NEONATO\nNão se aplica\n9.2.3 TRANSPLANTE CARDÍACO\nRecomenda-se a redução da dose inicial em pacientes submetidos a transplante de coração,\numa vez que no coração pós transplantado os nós sinusais e atrioventriculares apresentam-\nse mais sensíveis a adenosina.\n10. PRECAUÇÕES\n2,3,4,5\n\nRecomenda-se precaução durante o uso da adenosina em pacientes com histórico de\ndistúrbios convulsivos. A adenosina está associada ao desenvolvimento de crises tônico-\nclônicas. Em alguns casos, as convulsões foram prolongadas e exigiram tratamento\nanticonvulsivante de emergência.\nForam relatadas ainda situações de acidentes cerebrovasculares hemorrágicos e isquêmicos\nrelacionados a efeitos hemodinâmicos resultantes do uso da adenosina, como hipotensão ou\nhipertensão.\n10.1 CUIDADOS NA GRAVIDEZ\n\n\nFormulário Terapêutico Distrital\nNão foram realizados estudos em animais e nem em mulheres grávidas; ou então, os estudos\nem animais revelaram risco, mas não existem estudos disponíveis realizados em mulheres\ngrávidas.\n10.2 CUIDADOS NA AMAMENTAÇÃO\nNão há informações disponíveis a respeito da excreção da adenosina no leite humano. Caso\nnecessário o seu uso, os riscos de interrupção da amamentação após a administração da\nadenosina ou os riscos de exposição ao fármaco pelo lactente devem ser considerados.\n10.3 CUIDADOS NA CRIANÇA\nEm crianças e adolescentes que apresentem peso menor que 50kg, a dose máxima\nrecomendada é de 0,3mg/kg ou 12mg por dose, o que for menor.\n10.4 CUIDADOS NO IDOSO\nOs estudos clínicos realizados não incluíram número suficiente de pacientes com idade de\n65 anos ou mais, portanto, não foi possível a confirmação de uma resposta diferencial em\nrelação aos pacientes mais jovens. A adenosina deve ser utilizada com cautela em pacientes\nidosos, uma vez que essa população pode apresentar função cardíaca reduzida, disfunção\nnodal, doenças ou terapias concomitantes que podem alterar a função hemodinâmica e\nproduzir bradicardia severa ou bloqueio AV.\n11. CONSERVAÇÃO E ARMAZENAMENTO\n2,4\n\nEste medicamento deverá ser armazenado em temperatura ambiente (15 a 30°C), não deve\nser refrigerado pois há possibilidade de cristalização. E por não possuir conservante em sua\nformulação, se houver quantidade residual esta deve ser imediatamente descartada após a\nadministração.\n12. PRESCRIÇÃO\n\nE DISPENSAÇÃO\n1,6\n\n12.1 PRESCRIÇÃO\n12.1.1 RECEITUÁRIO\nPrescrição médica hospitalar, que deve ser realizada em sistema informatizado de gestão\nhospitalar ou prescrição manual de uso interno hospitalar, contendo as informações\nreferentes a identificação do paciente e a identificação do emitente (nome do profissional,\nnúmero do conselho regional ou instituição responsável, assinatura e carimbo).\n12.1.2 QUANTIDADE POR RECEITA\nNão se aplica\n12.1.3 LIMITE POR PRESCRIÇÃO\nNão se aplica\n12.1.4 VALIDADE\nNão se aplica\n12.2 DISPENSAÇÃO\n\n\nFormulário Terapêutico Distrital\nA dispensação dar-se-á restritamente nas farmácias das unidades hospitalares.\n13. ORIENTAÇÕES AO PACIENTE\n2,3,4\n\nNão se aplica\n14. ORIENTAÇÃO AO PROFISSIONAL DE SAÚDE\n3,4,5\n\n O medicamento deve ser administrado por via endovenosa direta e rápida (1 a 2\nsegundos), sem diluição.\n O medicamento deve ser administrado no sítio de injeção mais proximal ou no acesso\nvenoso central ou diretamente em um acesso periférico, recomenda-se seguir imediatamente\ncom a lavagem do acesso com SF 0,9%.\n Recomenda-se a monitoração de parâmetros para avaliação da conversão do ritmo sinusal\nou bloqueio atrioventricular através de eletrocardiograma.\n15. REFERÊNCIAS BIBLIOGRÁFICAS\n1.Secretaria de Estado de Saúde do Distrito Federal, Diretoria de Assistência Farmacêutica.\nCaderno técnico. Versão 6. Brasília: Secretaria de Estado de Saúde do Distrito Federal, 2020.\n2. Adenocard® [Bula] [Internet]. São Paulo: Libbs Farmacêutica Ltda;2013. [citado em 08 de\nnovembro de 2020] Disponível em:\nhttp://www.anvisa.gov.br/datavisa/fila_bula/frmVisualizarBula.asp\n3. Micromedex 2.0 [Internet]. Ann Arbor (MI): Truven Health Analytics Inc. 2018. Adenosina\n[cited 2020 Nov 08]. Available from: https://www.micromedexsolutions.com/home/dispatch\n4. Medscape [Internet]. New York (NY): Medscape LLC. 1994. Adenosine. [cited 2020 Nov\n08]. Available: https://reference.medscape.com/drug/adenocard-adenoscan-adenosine-\n342295.\n5. Neumar RW, Otto CW, Link MS, et al. Part 8: Adult Advanced Cardiovascular Life Support:\n2010 American Heart Association Guidelines for Cardiopulmonary Resuscitation and\nEmergency Cardiovascular Care. 2010\n6. Secretaria de Estado de Saúde do Distrito Federal. Relação de Medicamentos\nPadronizados - REME/DF - versão para profissionais de saúde [Internet]. Brasília: [citado em\n04 jan. 2021\n\n\nNome Cargo Data\nElaboração « Raiane Diniz Oliveira» «Farmacêutico» «07/12/2020»\nRevisão « Antonio Marco Santana Souza» « Farmacêutico » «03/02/2021»\nAprovação «Walleska Fidelis Gomes Borges»\n«Diretora de Assistência\nFarmacêutica»\n«13/05/2021»\nAtualização «atualizadores» «cargoatualizador» «dt_criacao»",
      "pageCount": 6,
      "errorMessage": null,
      "createdAt": "2025-12-08T03:26:55.433Z",
      "updatedAt": "2025-12-08T03:26:55.658Z"
    },
    {
      "id": "cdd04bfb-9b37-48a9-8114-a1689e416f32",
      "userId": "a76885c4-9792-401d-b69f-42ed35c5d123",
      "originalName": "972-Edital-de-Abertura-POSCOMP-2025_3.pdf",
      "storedName": "5ec7544f-4250-4220-a2c9-d9bd18ba146d.pdf",
      "filePath": "uploads\\a76885c4-9792-401d-b69f-42ed35c5d123\\5ec7544f-4250-4220-a2c9-d9bd18ba146d.pdf",
      "fileSize": 539833,
      "mimeType": "application/pdf",
      "status": "processed",
      "extractedText": "Exame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n1 | Página\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n2 | Página\n\nEXAME NACIONAL PARA INGRESSO NA PÓS-GRADUAÇÃO EM COMPUTAÇÃO/2025\nEDITAL SBC N. 001/2025\n\nThais Batista Vasconcelos, Presidente da Sociedade Brasileira de Computação (SBC), Instituição de Direito Privado,\nsediada na Av. Bento Gonçalves, nº 9500, Setor 4, Prédio 43.412, Sala 219, Bairro Agronomia, CEP 91.509-900, Porto\nAlegre – RS, CNPJ nº 29.532.264/0001-78, no uso das atribuições legais, torna pública, para conhecimento dos\ninteressados, a realização do Exame Nacional para Ingresso na Pós-Graduação em Computação/2025 (POSCOMP), de\nacordo com a legislação vigente e em conformidade com as normas estabelecidas neste Edital.\n\n1. DAS DISPOSIÇÕES PRELIMINARES\n1.1. O Exame Nacional para ingresso na Pós-Graduação em Computação (POSCOMP) será coordenado pela Sociedade\nBrasileira de Computação e será executado pela Fundação Universidade Empresa de Tecnologia e Ciências –\nFUNDATEC, localizada na Rua Professor Cristiano Fischer, 2012 – Porto Alegre/RS.\n1.1.1. Compete à Sociedade Brasileira de Computação a supervisão e a coordenação das atividades inerentes ao Exame\nPOSCOMP e ainda a esta Instituição e aos Coordenadores de Pós-Graduação ou profissionais devidamente indicados\npela SBC para a aplicação das provas.\n1.1.2. Compete à FUNDATEC a realização de todas as atividades necessárias à inscrição, elaboração, distribuição e\ncorreção das provas.\n1.2. O Exame POSCOMP tem como objetivo específico avaliar os conhecimentos dos candidatos interessados em\ningressar em Programas de Pós-Graduação em Computação e em áreas afins oferecidos no Brasil.\n1.3. O POSCOMP, por ser um Exame independente, não se configura como único critério para a seleção dos candidatos\nnos diversos programas de pós-graduação oferecidos no Brasil.\n1.4. A prova do Exame POSCOMP será elaborada em Língua Portuguesa, independentemente da origem do candidato\ne aplicada de forma ONLINE.\n1.5. O resultado do Exame POSCOMP será enviado pela SBC para todos os programas que dele participam, cabendo-\nlhes determinar a forma como estes irão aproveitá-lo.\n1.6. Integram o presente Edital os seguintes anexos:\na) Anexo I – Programa da Prova Teórico-Objetiva (Conteúdos Programáticos por Área de Conhecimento);\nb) Anexo II – Cronograma de Execução.\n1.7. Todos os horários referenciados neste Edital têm por base o horário oficial de Brasília-DF.\n\n2. DO PROCEDIMENTO DAS INSCRIÇÕES\n2.1. DAS INSCRIÇÕES\n2.1.1. Antes de inscrever-se no Exame POSCOMP, o candidato deverá ler o Edital, incluindo seus Anexos, para certificar-\nse de que preenche todos os requisitos exigidos.\n2.1.2. As inscrições serão realizadas no período determinado no Cronograma, exclusivamente pela internet, no site da\nFUNDATEC, endereço www.fundatec.org.br.\n2.1.2.1. Ao realizar sua inscrição, o(a) candidato(a) deverá assinalar a concordância com os termos que constam neste\nedital, e informar que aceita e autoriza a coleta e o uso de sua imagem bem como dos seus dados pessoais fornecidos,\nsensíveis ou não, para tratamento e processamentos inerentes a este certame, em observância aos princípios da\npublicidade e da transparência que regem a Administração Pública, de modo a garantir a lisura e prevenção à fraude,\nvisando dar efetiva proteção aos dados coletados, e nos termos da Lei Federal nº 13.709/2018.\n2.1.3. Procedimentos para Inscrições: Acessar o site da FUNDATEC (www.fundatec.org.br), a partir do primeiro dia\ndeterminado no cronograma e acessar Exame POSCOMP 2025. O candidato encontrará os links para acesso Edital de\nAbertura e Inscrições – Online.\n2.1.4. As inscrições serão submetidas ao sistema até as 17 (dezessete) horas do último dia previsto para encerramento\ndo respectivo prazo. Durante o processo de inscrição será emitido o boleto bancário com o valor da taxa de inscrição,\nsendo que o pagamento deverá ser feito em qualquer banco até o dia do vencimento indicado no boleto. O sistema de\ninscrições permitirá o débito em conta no banco emissor do boleto. Após dois dias úteis bancários do pagamento, o\ncandidato poderá consultar o site da FUNDATEC (www.fundatec.org.br) para confirmar o pagamento do seu pedido de\ninscrição.\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n3 | Página\n2.1.4.1. O documento emitido para pagamento é um boleto híbrido (bolepix), uma modalidade que permite ao pagador\nliquidar o boleto por meio da leitura do código de barras ou do QRcode apresentado no corpo do boleto (ficha de\ncompensação.\n2.1.5. Para efetuar a inscrição, é imprescindível o número do Cadastro de Pessoa Física (CPF).\n2.1.5.1. Após a realização do pagamento do boleto bancário, caso seja constatado que o candidato NÃO utilizou CPF ou\ndocumentos próprios no momento da inscrição, sua inscrição no POSCOMP será cancelada, e o candidato será\neliminado certame, a qualquer momento.\n2.1.5.2. Serão realizados os procedimentos acima, ainda que tenha sido provocado por equívoco do candidato e\nindependente de alegação de boa-fé.\n2.1.5.3. Os candidatos estrangeiros que não possuem o nº de CPF (Cadastro de Pessoa Física) ficam cientes de que\ndeverão gerar código de acesso através da ficha de inscrição.\n2.1.6. O candidato inscrito terá exclusiva responsabilidade sobre as informações cadastrais fornecidas, sob as penas da\nlei.\n2.1.7. As informações prestadas no formulário de inscrição são de inteira responsabilidade do candidato, dispondo a\nFUNDATEC o direito de excluir do Exame POSCOMP, independente de qualquer aviso ou diligência, aquele que\nfornecer dados comprovadamente inverídicos.\n2.1.8. O candidato deverá preencher, na ficha de inscrição, o seu nome completo, conforme documento de identificação\ne seus dados de identificação, conforme documento que será apresentado no dia de prova. Para qualquer necessidade\nde alteração, o candidato deverá solicitar a correção através do link “Alteração de Dados Cadastrais”, disponível em\nhttp://54.207.10.80/portal_pf/, no site da FUNDATEC www.fundatec.org.br.\n2.1.8.1. Qualquer divergência detectada, o candidato terá o prazo de 72 (setenta e duas) horas após a divulgação da\nLista Definitiva de Inscrições Homologadas para realizar a solicitação de correção de seus dados pessoais.\n2.1.8.2. Após os procedimentos citados acima, o candidato deverá realizar o pagamento da taxa de inscrição.\n2.1.9. O pagamento da taxa deverá ser efetuado até o dia determinado no cronograma de execução. A solicitação de\ninscrição cujo pagamento não for efetuado até esta data será cancelada.\n2.1.10. O candidato somente deverá efetuar o pagamento da taxa de inscrição após certificar-se de que preencheu\ncorretamente os dados do formulário de inscrição e constatar que possui todos os requisitos exigidos para o Exame,\npois, detectado erro após o pagamento, não haverá devolução do valor recolhido, quaisquer que sejam os motivos,\nsalvo os casos do subitem 2.1.17.\n2.1.11. O candidato deverá ficar atento ao dia de vencimento do boleto bancário. O sistema de inscrições permitirá ao\ncandidato reimprimir seu boleto bancário, com nova data de vencimento, sendo que o pagamento deverá ser efetuado\nimpreterivelmente até o dia determinado no cronograma de execução. Não serão aceitos pagamentos efetuados\nposteriormente a esta data.\n2.1.12. Os valores das taxas de inscrição são os abaixo determinados:\na) para os candidatos associados na Sociedade Brasileira de Computação: R$ 112,00 (cento e doze reais);\nb) para os candidatos NÃO associados: R$ 151,00 (cento e cinquenta e um reais);\nc) para os candidatos, alunos de Graduação, não associados que realizarem a associação à SBC no momento da\nInscrição – Inscrição COMBO*: R$ 145,00 (cento e quarenta e cinco reais).\n*Inscrição + anuidade, sendo válida apenas para alunos de graduação e mediante comprovante de matrícula.\n2.1.13. O candidato, aluno de graduação, que não seja associado e pretenda associar-se, deve entrar no site da\nFUNDATEC, realizar a inscrição, e, no momento da inscrição, solicitar a associação junto à SBC e encaminhar o\ncomprovante de matricula atualizado.\n2.1.13.1. Os candidatos que optarem pela inscrição na modalidade COMBO (associação + inscrição) terão sua\nassociação confirmada somente após o envio do comprovante de matrícula e de inscrição para, o endereço de e-mail\nsbc@sbc.org.br. O prazo máximo para envio do comprovante é até o dia 09 de julho de 2025. Os candidatos que não\nencaminharem o comprovante de matrícula não terão o valor referente à associação reembolsado.\n2.1.14. O candidato que desejar usufruir do benefício do pagamento de inscrição como associado deverá estar em dia\ncom a anuidade junto à SBC antes da realização da inscrição. A associação pode levar de 1 (um) a 3 (três) dias úteis\npara ser confirmada.\n2.1.14.1. Após a confirmação de associação à SBC, o candidato deverá acessar a ficha de inscrição com seu CPF e o\nsistema gerará automaticamente o desconto. Caso o sistema não gere o desconto de associado, o candidato deverá\nentrar em contato com a SBC ou com a FUNDATEC.\n2.1.14.1.1. Caso o candidato realize o pagamento da taxa de inscrição como não associado à SBC e, após, associe-se\nà SBC, a diferença do valor da taxa de inscrição não será devolvida para o candidato.\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n4 | Página\n2.1.15. Não serão aceitos pagamentos com taxas inferiores às estipuladas neste Edital.\n2.1.16. Será cancelada a inscrição com pagamento efetuado por valor menor do que o estabelecido neste Edital e as\nsolicitações de inscrições cujos pagamentos forem efetuados após a data de encerramento das inscrições, não sendo\ndevolvido ao candidato qualquer ressarcimento da importância paga.\n2.1.17. O valor referente ao pagamento da taxa de inscrição será devolvido em caso de cancelamento do Exame\nPOSCOMP por conveniência ou interesse da SBC ou em casos de pagamento em duplicidade.\n2.1.17.1. Caso seja comprovado o pagamento em duplicidade (mesmo nº de boleto), os candidatos deverão entrar em\ncontato com a FUNDATEC para a solicitação da análise de possível duplicidade, através dos canais de comunicação.\nSerá providenciada a devolução do valor de uma das taxas, mediante o desconto de R$ 10,00 referente aos custos de\ntarifas bancárias, ficando o candidato ciente que dependerá dos tramites processuais da instituição arrecadadora.\n2.1.18. Não serão restituídos valores de inscrição pagos a maior.\n2.1.19. Serão canceladas as inscrições pagas com cheque, agendamentos bancários, pix e outros meios, a exceção dos\ncasos de candidatos que optarem em realizar a prova no exterior, no qual o pagamento da taxa será realizado através\nde cartão de crédito internacional. Não serão homologadas as inscrições cujos boletos não forem pagos da forma\nadequada.\n2.1.19.2. Também não serão homologadas as inscrições cujos boletos forem pagos em data posterior ao último dia de\npagamento previsto no Cronograma de Execução, não sendo devido ao candidato qualquer ressarcimento da importância\npaga.\n2.1.19.3. O pagamento processado após a última data prevista de pagamento determinada implicará no indeferimento\nda inscrição.\n2.1.20. Não é de competência da FUNDATEC regulamentar ou informar horários limites de pagamentos dos boletos,\nsendo de responsabilidade unicamente dos órgãos que prestam serviços de recebimentos bancários essa determinação.\nCabe ao candidato se informar sobre os horários de recebimento dos estabelecimentos, tais como: Casas lotéricas,\nagências bancárias, entre outros, bem como verificar as regras de aplicativos, Internet Banking e acompanhar casos de\ngreve, etc., bem como o conhecimento da data de processamento do pagamento realizado.\n2.1.20.1. A FUNDATEC não se responsabiliza por fraudes em boletos ocasionados por programas/softwares maliciosos’\nque por ventura se instalem no computador utilizado pelo candidato. Antes de pagar qualquer boleto bancário, o candidato\ndeve verificar os dados impressos, como número do banco, logo do banco, se o número do código de barras corresponde\nao da parte de cima da fatura, CNPJ, data de vencimento do título e se o valor cobrado corresponde ao devido.\n2.1.21. O candidato é responsável pelas informações prestadas na ficha de inscrição, arcando com as consequências\nde eventuais erros de preenchimento daquele documento.\n2.1.21.1. Caso o candidato realize mais de uma inscrição, apenas a última inscrição realizada e devidamente paga será\nhomologada, as demais serão bloqueadas no sistema.\n2.1.22. Será de inteira responsabilidade do candidato a impressão e a guarda do seu comprovante de pagamento da\ninscrição.\n2.1.23. O simples comprovante de agendamento bancário não será aceito como comprovante de pagamento da\ninscrição.\n2.1.24. O boleto bancário, com a autenticação mecânica, ou o comprovante de pagamento bancário, até a data limite\ndo vencimento, será o único comprovante de pagamento aceito.\n2.1.25. Não será aceita inscrição condicional, extemporânea, por via postal, via fax ou via correio eletrônico. Verificado,\na qualquer tempo, o recebimento de inscrição que não atenda a todos os requisitos fixados neste Edital, esta será\ncancelada.\n2.1.26. É vedada a transferência para terceiros do valor pago a título de taxa, assim como a transferência da inscrição\npara outrem.\n2.1.27. A FUNDATEC não se responsabilizará por solicitação de inscrição não recebida em consequência de ordem\ntécnica dos computadores, falhas de comunicação, congestionamento de linhas de comunicação, bem como de outros\nfatores, alheios a FUNDATEC, que impossibilitem a transferência de dados.\n2.1.28. O candidato que desejar algum atendimento especial para o dia de prova deverá seguir o disposto no item 4\ndeste Edital.\n2.1.29. A pessoa travesti, transexual ou transgênera será tratada de forma adequada à sua identidade gênero, com uso\nde pronomes adequados e com acesso seguro e adequado a todos os espaços destinados à realização do concurso,\nseguindo as orientações constantes na IN MGI/MDHC nº 54, de 29/08/2024.\n2.1.29.1. Nome Social: A pessoa travesti, transexual ou trangênera, que desejar ser tratada pelo nome social durante o\ncertame, deverá informar, na ficha de inscrição e deverá realizar o upload do documento, nos campos indicados pelo\nsistema, que conste seu Nome Social (frente e verso), com tamanho máximo de 5 Megabytes e com as seguintes\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n5 | Página\nextensões: JPG, JPEG, PNG ou TIFF.\n2.1.29.2. É vedada a inclusão de alcunhas ou apelidos no campo destinado ao nome social.\n2.1.29.3. Para os candidatos que não tiveram documento oficial constando o Nome Social, poderá ser enviado uma\ndeclaração, feita a próprio punho, contendo o nome pela qual o candidato deseja ser tratado.\n2.1.30. O candidato somente será considerado inscrito no Exame POSCOMP 2025 após ter cumprido todas as\ninstruções descritas neste Edital.\n2.1.30.1. Considera-se inscrição efetivamente realizada, aquela que foi concluída no prazo determinado.\n2.1.31. O ato de inscrever-se no Exame POSCOMP 2025 implica o pleno conhecimento e a tácita aceitação das\ncondições estabelecidas neste Edital e demais instrumentos reguladores, dos quais o candidato não poderá alegar\ndesconhecimento.\n2.1.32. A FUNDATEC encaminha, para o endereço eletrônico fornecido na ficha de inscrição, e-mail meramente\ninformativo ao candidato, não o isentando de buscar as informações nos locais informados no Edital. O site da\nFUNDATEC www.fundatec.org.br será fonte permanente de comunicação de avisos e editais, além das publicações em\njornal local dos extratos do Edital de Abertura, Edital de Data e Hora da Prova Teórico-Objetiva.\n2.1.33. As inscrições que não atenderem às normas dispostas neste Edital serão canceladas.\n\n2.2. DA FOTO DIGITAL\n2.2.1. No momento da inscrição, o candidato deverá enviar, via upload, uma foto digital atualizada de seu rosto, em que\nnecessariamente apareça a sua face descoberta e os seus ombros.\n2.2.1.1. O candidato poderá seguir o modelo de foto contida em documentos de identificação oficiais, tais como RG,\nCNH, etc., não sendo permitida a utilização de qualquer tipo de adereço que impossibilite a identificação do rosto, como\nóculos de sol, chapéus, máscaras, etc.\n2.2.2. O candidato deverá seguir rigorosamente as instruções contidas no sistema de inscrição referente ao procedimento\nde envio da foto digital.\n2.2.2.1. Somente são aceitos arquivos com extensão .jpg, .jpeg, ou .png.\n2.2.2.2. A imagem deve possuir boa qualidade; apresentar somente o rosto de frente e visualização dos olhos na foto.\n2.2.2.3. A foto deve permitir o reconhecimento do candidato no dia de prova.\n2.2.3. O envio da fotografia é de responsabilidade exclusiva do candidato.\n2.2.4. A FUNDATEC não se responsabiliza por qualquer tipo de problema que impeça a chegada do arquivo ao seu\ndestino, seja de ordem técnica dos computadores, seja decorrente de falhas de comunicação ou de outros fatores que\nimpossibilitem o envio.\n2.2.5. A foto digital encaminhada servirá para reconhecimento no dia da prova e comparação do candidato com o\ndocumento de identificação apresentado.\n2.2.5.1. Caso o candidato tenha sua foto digital não aceita, ou seja, não esteja de acordo para fins de identificação no\ndia de prova, deverá regularizar a sua situação durante o período de recurso da Homologação Preliminar das Inscrições,\natravés do Formulário Online de Regularização de Foto.\n2.2.6. No dia de aplicação de prova, caso a foto digital encaminhada não permita o reconhecimento, o candidato será\nencaminhado à Coordenação Local da Fundatec e submetido à identificação especial, desde que não infrinja o disposto\nno subitem 2.2.7.1.\n2.2.7. O candidato, ao se inscrever, autoriza o uso da imagem para as finalidades do presente Exame, estando ciente de\nque a foto será utilizada em materiais impressos, como lista de presença e grade de resposta. Além disso, a foto será\nencaminhada para fins de verificação no ato da matrícula, com a finalidade de garantir a lisura do certame.\n2.2.7.1. O candidato que submeter fotos que violem ou infrinjam os direitos de outra pessoa e/ou de fotos que contenham\nconteúdo sexual explícito, nudez, conteúdo obsceno, violento ou outros conteúdos censuráveis ou inapropriados será\nexcluído do Exame, em qualquer momento do processo.\n\n2.3. DA ISENÇÃO DA TAXA DE INSCRIÇÃO\n2.3.1. Estará isento do pagamento da taxa de inscrição, conforme previsto no Decreto Federal nº 6593/2008 e Lei Federal\nnº 13.656/2018:\na) O candidato que estiver inscrito no Cadastro Único para Programas Sociais do Governo Federal (CadÚnico),\ncuja renda familiar mensal per capita seja inferior ou igual a meio salário-mínimo nacional, de que trata o Decreto\nFederal nº 11.016/2022;\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n6 | Página\nb) O candidato que for doador de medula óssea em entidades reconhecidas pelo Ministério da Saúde, de acordo\ncom a Lei nº 13.656/2018.\n2.3.2. A isenção deverá ser solicitada mediante requerimento do candidato, no período previsto no Cronograma de\nExecução.\n2.3.2.1. PARA OS CANDIDATOS INSCRITOS NO CADÚNICO:\n2.3.2.1.1. Para obter a isenção o candidato deverá providenciar a inscrição provisória no site da FUNDATEC\n(www.fundatec.org.br) e preencher o Requerimento de Isenção disponível no Link Formulário Online - Solicitação de\nIsenção de Taxa, comprovando o enquadramento de seu pedido, que deverá conter:\na) indicação do Número de Identificação Social (NIS), atribuído pelo CadÚnico; e\nb) declaração de que atende à condição estabelecida na alínea “a” do subitem 2.3.1.\n2.3.2.1.2. A FUNDATEC consultará o órgão gestor do CadÚnico para verificar a veracidade das informações prestadas\npelo candidato.\n2.3.2.1.3. O candidato que requerer a isenção deverá informar, no ato da inscrição, seus dados pessoais rigorosamente\nem conformidade com os que foram originalmente informados ao órgão de Assistência Social de seu Município,\nresponsável pelo cadastramento de famílias no CadÚnico. O candidato deve atentar-se que, qualquer dado que tenha\nsido alterado/atualizado junto ao CadÚnico, nos últimos 45 (quarenta e cinco) dias, poderá causar divergência entre o\ndado informado (atualizado) e o ainda constante no sistema do CadÚnico, em virtude do decurso de tempo para\natualização do banco de dados do CadÚnico em âmbito nacional.\n2.3.2.1.4. Mesmo que inscrito no CadÚnico, a inobservância do disposto no subitem anterior poderá implicar ao candidato\no indeferimento do seu pedido de isenção, por divergência dos dados cadastrais informados e os constantes no banco\nde dados do CadÚnico. Após a solicitação e julgamento do pedido de isenção, não será permitido a complementação ou\nalteração de dados para obtenção da isenção.\n2.3.2.2. PARA OS CANDIDATOS DOADORES DE MEDULA ÓSSEA:\n2.3.2.2.1. O benefício da Lei Federal nº 13.656/2018 será concedido às pessoas que possuírem cadastro no REDOME,\nque apresentarem carteira do REDOME ou declaração confirmando seu cadastro no banco de dados como possível\ndoador de medula óssea, emitida por entidade coletora até a data de publicação do Edital de Abertura, em órgãos oficiais\nou entidades credenciadas pela União, Estado ou Município, Hemocentros e nos Bancos de Sangue de Hospitais.\n2.3.2.2.1.1. Para obter a isenção, o candidato deverá providenciar a inscrição provisória no site da FUNDATEC\n(www.fundatec.org.br) e anexar cópia da carteira do REDOME ou declaração de doador de medula óssea, emitida por\nEntidade Coletora, contendo o nome completo do candidato, pelo link Formulário Online – Solicitação de Isenção da\nTaxa de Inscrição, comprovando o enquadramento de seu pedido.\n2.3.2.3. Para o envio dos documentos da condição de isento como Doador de Medula Óssea, conforme exposto acima,\nos candidatos deverão realizar, durante o período estabelecido no Cronograma de Execução, as etapas descritas abaixo:\na) Acessar o site da FUNDATEC, onde estará disponível o Link Formulário Online - Solicitação de Isenção de\nTaxa”, para upload dos documentos escaneados para avaliação;\nb) Encaminhar documentos com tamanho máximo de 5 Megabytes cada, e com as seguintes extensões: JPG,\nJPEG, BMP, PDF, TNG ou TIFF;\nc) Após o preenchimento do Formulário Online, o candidato visualizará seu protocolo de envio dos documentos.\n2.3.2.4. Os documentos deverão ser enviados através do site até as 17(dezessete) horas do último dia previsto no período\nde entrega constante no Cronograma de Execução.\n2.3.2.5. A FUNDATEC não se responsabiliza por qualquer dificuldade de acesso ao site.\n2.3.3. Ao preencher o Formulário Online – Solicitação de Isenção da Taxa de Inscrição, o candidato declara que as\ninformações prestadas são verdadeiras, estando ciente de que, se comprovada a omissão ou a inveracidade nas\ninformações prestadas ou nos documentos apresentados, ficará sujeito às penalidades legais cabíveis, aplicando-se,\nainda, o disposto no artigo 299 do Código Penal. A falta parcial ou total de informações ou documentos poderá ser motivo\npara indeferimento da solicitação, ou até mesmo, da sua eliminação.\n2.3.4. Não será concedida isenção de pagamento de taxa de inscrição ao candidato que:\na) omitir informações e/ou torná-las inverídicas;\nb) fraudar e/ou falsificar documentação;\nc) não observar a forma estabelecida nos itens 2.3.2.1 e 2.3.2.2 e seus subitens deste Edital.\n2.3.5. Não será aceita solicitação de isenção de pagamento de valor de inscrição via postal ou via e-mail.\n2.3.6. Somente serão analisados os pedidos que forem protocolados pelo Formulário Online. Não serão aceitas\nsolicitações de isenção de pagamento de valor de inscrição encaminhadas via postal, via e-mail ou qualquer outra forma\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n7 | Página\nnão estabelecida nesse item.\n2.3.7. Caso o candidato realize mais de uma inscrição, será concedida isenção apenas para a inscrição escolhida de\nacordo com o último protocolo registrado no sistema de isenção.\n2.3.7.1. Somente será validado o último protocolo registrado no sistema desde que a inscrição tenha sido realizada no\nperíodo de solicitação de isenção, conforme Cronograma de Execução, e tenha sido solicitado para a respectiva\nnumeração.\n2.3.8. Não serão realizadas alterações após o deferimento da inscrição isenta.\n2.3.9. A relação dos pedidos de isenção deferidos será divulgada no dia previsto no Cronograma de Execução.\n2.3.10. Para a comprovação da situação de isento, os candidatos que tiveram seus pedidos indeferidos, além de\nacessarem o Formulário Online de Recurso, poderão enviar documentação complementar pelo link Formulário Online –\nEntrega de Documentos, na forma do subitem 2.3.2.3, durante o período de recurso, disponível no site da FUNDATEC.\n2.3.10.1. A documentação para comprovação da situação regular de isento deve ter sido emitida até 90 dias antes da\npublicação do Edital de Abertura.\n2.3.11. Os candidatos que tiverem seus pedidos indeferidos deverão, para efetivar a sua inscrição no Exame, acessar o\nendereço do site da FUNDATEC (www.fundatec.org.br) e imprimir o boleto bancário para pagamento até o último dia\nprevisto no Cronograma de Execução, conforme procedimentos descritos neste Edital.\n2.3.12. O interessado que não tiver seu pedido de isenção deferido e que não efetuar o pagamento da taxa de inscrição\nna forma e no prazo estabelecidos no subitem anterior estará automaticamente excluído do Exame.\n2.3.13. A FUNDATEC, a qualquer tempo, poderá fazer diligências relativas à situação declarada pelo candidato, deferindo\nou não seu pedido de isenção, ou ainda, detectada declaração falsa, será excluído do certame se detectada declaração\nfalsa, aplicando-se as demais sanções penais cabíveis.\n2.3.14. Caso o candidato receba a isenção da taxa de inscrição, porém tenha efetuado o pagamento do boleto bancário\nantes do período previsto para a divulgação do Resultado dos Pedidos de Isenção da Taxa de Inscrição, o valor referente\na taxa paga não será devolvido.\n2.3.15. Caso o candidato receba a isenção da taxa de inscrição, porém tenha efetuado o pagamento do boleto bancário\nantes do período previsto para a divulgação do Resultado Preliminar dos Pedidos de Isenção da Taxa de Inscrição, o\nvalor referente à taxa paga não será devolvido.\n\n3. DA HOMOLOGAÇÃO DAS INSCRIÇÕES\n3.1. O candidato que efetivar mais de uma inscrição, terá apenas a última inscrição realizada e devidamente paga\nhomologada, as demais serão bloqueadas no sistema.\n3.2. A inscrição só será confirmada mediante informação da rede bancária, considerando em torno de 2 (dois) dias úteis\nbancários para enviar o arquivo retorno sobre o pagamento da inscrição.\n3.3 Os eventuais erros de digitação verificados na Lista de Homologação – Consulta por CPF, quanto a nome, número\nde documento de identificação e data de nascimento, deverão ser corrigidos, primeiramente, através do link “Alteração\nde Dados Cadastrais”, disponível em http://54.207.10.80/portal_pf/, no site da FUNDATEC www.fundatec.org.br, sob\npena de ser impedido de realizar a prova. Além disso, o candidato deverá sinalizar a solicitação de alteração de dados\ncadastrais pelo Formulário Online de Recurso da Homologação Preliminar das Inscrições.\n3.4 O candidato que não solicitar as correções de seus dados pessoais, deverá arcar com as consequências advindas\nde sua omissão e desatenção.\n3.5 Da não homologação ou das divergências em relação à inscrição cabe recurso, conforme previsto no item 7.\n\n4. DO ATENDIMENTO ESPECIAL PARA A REALIZAÇÃO DA PROVA\n4.1. Caso o candidato necessite de atendimento especial para a realização da Prova Teórico-objetiva, deverá formalizar\no pedido através da ficha online de inscrição, selecionando a(s) opção(ões) desejada(s), e encaminhar laudo médico\ne/ou documento(s) comprobatório(s) que comprove(m) a necessidade. Os documentos deverão ser encaminhados\ndurante o período previsto no cronograma de execução.\n4.2. São procedimentos especiais que poderão ser realizados no dia de prova, desde que solicitados e comprovados por\nlaudo médico e/ou documentos comprobatórios:\n4.2.1. Necessidades Visuais:\nI) Uso de reglete ou lupa manual: Ao candidato que necessitar será permitido o uso de reglete ou lupa manual.\nII) Sistema de Leitor de Tela – NVDA: candidato com deficiência visual (cegueira ou baixa visão) que necessite\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n8 | Página\nutilizar em seu computador o programa de voz sintética que faz audiodescrição das questões da prova.\n4.2.2. Necessidades Auditivas:\nI) Intérprete de Libras: será oferecido profissional habilitado para mediar a comunicação entre surdos e ouvintes\nno repasse das orientações/instruções durante a prova.\nII) Prótese Auditiva: será permitido ao candidato permanecer com o aparelho auditivo durante a realização da\nprova se encaminhar documento comprobatório contendo a descrição da necessidade contínua da prótese.\nObservação: No dia de prova, caso o candidato que utiliza prótese auditiva não tiver encaminhado o\ndocumento no período das inscrições, serão tomadas as seguintes providencias:\na) se o candidato apresentar para o fiscal, durante o ato de identificação, documento comprobatório original\nou autenticado em cartório, será autorizado a permanecer com a prótese durante a prova.\nb) se o candidato se apresentar para o fiscal, durante o ato de identificação, sem documento comprobatório\noriginal ou autenticado em cartório, será concedido apenas o uso do aparelho no momento da identificação\ndo candidato, sendo que, durante a realização da prova, deverá retirá-la e desligá-la, não podendo o\ncandidato alegar qualquer prejuízo no seu desempenho.\nc) se o candidato não se apresentar para o fiscal durante o ato de identificação e for detectado durante a\nrealização da prova fazendo uso de prótese auditiva, este será eliminado do certame.\n4.2.3. Necessidades Complementares:\nI) Uso de aparelhos de medição de glicemia: os usuários regulares de aparelhos de medição de glicemia deverão\nencaminhar documento médico que comprove a necessidade, cujo equipamento será avaliado antes do início das\nprovas. Caso o aparelho emita som, é importante que o candidato comunique ao fiscal para tomar as medidas\nnecessárias de controle e segurança.\nII) Amamentação: A Candidata que tiver necessidade de amamentar no período de realização da prova, deverá\nter um responsável legal pela criança durante a prova, e que deverá estar em outro ambiente que não seja no local\nem que a candidata estará realizando a prova. Quando da necessidade de amamentação, o acompanhante deverá\nentregar a criança à lactante e sair do local, voltando tão somente para buscar o bebê. O ato de amamentação\ndeverá ser realizado de frente as câmeras, sabendo que a Fundatec terá todo o cuidado para preservação desse\nmomento. A amamentação será concedida somente para bebês de até 06 meses de idade.\nIII) Tempo Adicional: Ao candidato com baixa ou nenhuma visão, com deficiência auditiva, diagnóstico de dislexia,\nTDAH, Transtorno do Espectro Autista, entre outros, poderá ser oferecido o tempo adicional de 1 (uma) hora para\na realização das provas escritas. Se houver a necessidade de tempo adicional, no documento comprobatório\ndeverá conter a justificativa/parecer emitido por especialista da área da deficiência/doença.\nIV) Profissional de apoio: atendimento concedido ao candidato com Autismo que necessite acompanhamento\ndurante a provas escritas, oferecendo o suporte adequado.\n4.3. Os documentos comprobatórios deverão ter data de emissão posterior ao dia 22/11/2024 e conter a assinatura do\nprofissional de saúde de nível superior, número de inscrição no conselho regional de fiscalização da profissão\ncorrespondente e assinatura do profissional de saúde, à exceção dos documentos que atestam deficiências permanentes\ne o Transtorno do Espectro Autista – TEA.\n4.3.1. Em caso de impedimentos irreversíveis, que configurem deficiência permanente ou de pessoas com TEA, a\nvalidade por prazo indeterminado, não sendo considerada a data de emissão, desde que o documento seja legível e que\ncontenha a caracterização da deficiência, a identificação do candidato e ateste a espécie e o grau ou o nível de sua\ndeficiência, bem como suas limitações funcionais e necessidades de adaptações, conforme Lei Federal nº 13.146/2015.\n4.4. Para o envio do laudo médico e/ou documentos comprobatórios, os candidatos deverão realizar as etapas descritas\nabaixo:\na) O candidato deverá acessar o site da FUNDATEC (www.fundatec.org.br), onde estará disponível o link para\nentrega “Formulário Online – Laudo Médico e/ou Atendimento Especial”, para upload dos documentos escaneados\npara avaliação.\nb) Encaminhar documentos com tamanho máximo de 5 Megabytes e com as seguintes extensões: JPG, JPEG,\nBMP, PDF, PNG ou TIFF.\nc) Após o preenchimento do Formulário Online, o candidato visualizará seu protocolo de envio dos documentos.\n4.4.1. Os documentos deverão ser postados até às 17 (dezessete) horas do último dia previsto no período de entrega\nconstante no Cronograma de Execução.\n4.4.2. Não serão aceitos laudos médicos e/ou documentos comprobatórios:\na) Do candidato que não os enviar conforme estabelecido por este edital;\nb) Arquivos corrompidos;\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n9 | Página\nc) Apresentados em documentos ilegíveis e/ou com rasuras;\nd) Incompletos e/ou que não contenham informações suficientes para justificar a solicitação.\n4.5. Os laudos médicos terão valor somente para este Exame, não sendo devolvidos aos candidatos.\n4.6. A Comissão de Concurso da FUNDATEC examinará a fundamentação de todas as solicitações, sendo o parecer\namplamente divulgado por meio do Edital de Homologação das Inscrições.\n4.6.1. A solicitação de atendimento especial, em qualquer caso, será concedida segundo os critérios de viabilidade e de\nrazoabilidade.\n4.6.2. Cabe exclusivamente ao candidato verificar se o seu pedido de atendimento especial foi deferido para a realização\ndas provas.\n4.7. A FUNDATEC se reserva ao direito de não atender qualquer necessidade do candidato que não for solicitada na\nficha de inscrição e, por conseguinte, que não apresentar a devida comprovação, por laudo médico, no período previsto\nno cronograma de execução.\n4.8. O candidato que não solicitar atendimento especial por sistema online de inscrição ou não especificar qual(is) o(s)\natendimento(s) necessário(s), terá seu pedido de atendimento especial indeferido.\n4.8.1. Nos casos de força maior, em que seja necessário solicitar atendimento especial após a data determinada no\nCronograma de Execução, o candidato deverá enviar solicitação de atendimento especial via e-mail para:\natendimento.especial@fundatec.org.br, juntamente com cópia digitalizada do laudo médico específico que justifique o\npedido.\n4.9. Os recursos, acima descritos, que necessitem o uso de computadores, bem como a utilização de softwares, se\nconstatado, durante a realização da prova, problemas técnicos e/ou operacionais, a Comissão do Concurso da\nFUNDATEC irá avaliar com a Coordenação Local da Fundatec, outros recursos que supram a necessidade do candidato,\ndiante da viabilidade e razoabilidade do momento.\n4.9.1. A troca dos recursos oferecidos, não poderá ser alegado como motivo de baixo desempenho do candidato na\nprova.\n4.10. A solicitação de atendimento especial, em qualquer caso, será concedida segundo os critérios de viabilidade e de\nrazoabilidade.\n4.10.1. Havendo ocorrências inesperadas no dia de prova, serão avaliadas pela Comissão de Concurso da FUNDATEC\nas possibilidades operacionais disponíveis, bem como a preservação da segurança, lisura e isonomia da aplicação da\nprova. Os procedimentos adotados serão informados ao candidato e registrados em ata, não cabendo qualquer\nreclamação posterior. Nessa situação, poderá ser solicitado ao candidato o envio de laudo médico, que deverá ser\nencaminhado em até 7 (sete) dias posteriores à aplicação da prova. O não atendimento da solicitação determinada pela\nCoordenação Local da FUNDATEC acarretará em eliminação do candidato no certame.\n4.10.2. Nos casos de atendimentos especiais intempestivos, será solicitado ao candidato a apresentação de documento\ncomprobatório, conforme critérios estabelecidos no item 4 deste edital, que justifique o pedido no dia de prova ou o\nencaminhamento até no prazo determinado no Cronograma de Execução, por meio do Formulário Online – Atendimento\nintempestivo e/ou Identificação Especial.\n4.10.2.1. A não apresentação da documentação comprobatória acarretará na eliminação do candidato no certame, seja\nqual for o atendimento concedido.\n\n5. DA PROVA TEÓRICO-OBJETIVA E DAS CONDIÇÕES PARA SUA REALIZAÇÃO\n5.1. O Exame POSCOMP será realizado em uma única etapa, por meio de Prova Teórico-Objetiva.\n5.2. A Prova Teórico-objetiva será de múltipla escolha, com 5 (cinco) alternativas (A, B, C, D, E), devendo o candidato\nassinalar UMA única resposta para cada questão.\n5.3. As áreas de conhecimento da Prova Teórico-Objetiva, o número de questões e o valor da prova estão apresentados\na seguir.\nÁREA DE CONHECIMENTO NÚMERO DE QUESTÕES\nMatemática 20\nFundamentos da Computação 30\nTecnologia de Computação 20\nTOTAL DE QUESTÕES 70\n5.4. A Prova Teórico-objetiva será elaborada de acordo com os conteúdos programáticos de cada área de conhecimento\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n10 | Página\nque constam do Anexo I.\n5.5. A correção das questões da Prova Teórico-objetiva será feita por meio online. Cada acerto em uma questão objetiva\nvalerá 1 (um) ponto, sendo 70 a pontuação máxima dessa prova.\n5.6. O resultado da Prova Teórico-objetiva será a soma dos pontos obtidos em cada questão.\n5.7 DAS CONDIÇÕES GERAIS PARA SUA REALIZAÇÃO\n5.7.1. A Prova Teórico-Objetiva, será realizada, exclusivamente, no Formato ONLINE, em um único dia e horário, pelo\nambiente virtual que será disponibilizado ao candidato através de link de acesso ao sistema de provas eletrônica,\nenviado ao e-mail informado pelo candidato no ato da inscrição, com antecedência mínima de 03 (três) dias úteis da\naplicação da prova.\n5.7.1.1. O link de acesso à prova será informado no Edital de Convocação para essa fase, conforme Cronograma de\nExecução.\n5.7.1.2. Ao receber o link, para prosseguir com a realização da prova online no dia do exame, o candidato deverá ler e\nconcordar com os Termos de Aceite, afirmando que durante a realização da prova ele não poderá fazer uso de materiais\nde consulta, que não poderá solicitar ajuda de outras pessoas e compartilhar o link recebido, ou que utilizará de qualquer\nmeio fraudulento para a realização da prova sob pena de ser eliminado do processo.\n5.7.2 A efetivação da inscrição implica a aceitação e concordância do(a) candidato(a) com o procedimento e termos\ndescritos neste artigo, sem direito a pleitear com referência a este assunto, ciente de que a utilização dos recursos visa\nao bom andamento dos trabalhos e à lisura do processo, assim como à garantia dos direitos individuais e coletivos.\n5.7.3. É responsabilidade exclusiva do candidato acessar previamente o link e efetuar o cadastramento, a leitura e o\naceite das condições e instruções para a realização da prova e a garantia da conectividade com a internet durante todo\no período de realização.\n5.7.4. O candidato deverá realizar a prova em computador por meio do ambiente virtual de avaliação e enviá-la para\ncorreção, pelo próprio sistema. Para a realização da prova o candidato deve possuir computador (desktop ou notebook)\ncom webcam e microfone, habilitados para monitoramento (proctoring e e-proctoring), e atender aos seguintes\nrequisitos mínimos:\na) Conexão de internet de 10 MBps no mínimo;\nb) Utilizar o navegador Google Chrome (versão 100 ou superior);\nc) O sistema de prova online não é compatível com dispositivos móveis (celulares e tablets).\n5.7.4.1. A aplicação da prova online possui normas e ações de segurança digital baseadas em ferramentas\nespecializadas (gravação de tela, e-proctoring por inteligência artificial, proctoring guiado por fiscais, gravação do vídeo,\nsom e tela do candidato, e processo de autorização para início da prova) de forma que sejam garantidas a veracidade\ndas informações, a fim de se evitar fraude durante a realização da prova.\n5.7.4.2. A FUNDATEC e a Sociedade Brasileira de Computação (SBC) não se responsabilizam por ausência de\nrequisitos necessários à prestação da prova, falhas técnicas de computadores pessoais, falhas de comunicação,\ncongestionamento de linhas de comunicação, falta de energia elétrica, bem como de outros fatores de ordem técnica\ndo local onde o candidato fará a prova, que impossibilitem a realização e/ou a finalização ou envio de suas respostas.\n5.7.4.3. É responsabilidade do candidato providenciar o espaço físico onde fará a prova, que deverá ser isolado e\nsilencioso. Também é responsabilidade do candidato providenciar neste local um computador com acesso à internet\nde qualidade, com câmera e microfones funcionando.\n5.7.4.4. Não haverá segunda chamada para realização da prova, em hipótese alguma. O candidato que deixar de\nacessar nos horários determinados no Edital de Convocação será eliminado do processo seletivo.\n5.7.4.5. Não será possível realizar a prova através de celular, tablet ou outro dispositivo que não seja um computador\ncom as condições especificadas acima.\n5.7.4.6. Não é permitida a utilização de duas telas simultâneas para realização da prova: O sistema possui trava\nautomatizada para detectar e bloquear o uso de uma segunda tela.\n5.7.4.7. Caso a conexão seja interrompida durante a prova, o candidato poderá acessá-la novamente pelo mesmo link,\nporém, nesse caso, não haverá concessão de tempo adicional.\n5.7.4.8. Antes do acesso a plataforma, o candidato deve limpar o cache do navegador, fechar todas as outras abas,\nbem como quaisquer outros programas, deixando apenas a aba da plataforma de aplicação da prova aberta.\n5.7.4.9. É recomendado ao candidato que desabilite a proteção de tela do computador, programas antivírus e possíveis\nnotificações de sites e aplicações que estejam ativos em seu navegador ou sistema operacional. Tal ação é necessária\npara evitar a contabilização automática de saída de tela, devido às configurações de segurança da plataforma.\n5.7.5. No dia de prestação da prova, o candidato obriga-se a acessar o sistema de avaliação com no mínimo 60\n(sessenta) minutos de antecedência do horário estipulado para início da prova.\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n11 | Página\n5.7.6. Não é permitido fazer a prova em ambientes externos. O candidato deve estar em um local tranquilo e\ncompletamente sozinho no momento do exame.\n5.7.7. A câmera e o microfone devem estar descobertos e captando claramente a imagem do candidato inscrito e o\nsom ambiente durante a realização do exame. O candidato deverá permitir o acesso à câmera e ao microfone pelo\nsistema de prova online.\n5.7.8. Após entrar no ambiente virtual o candidato deverá apresentar ao fiscal seu documento de identificação.\n5.7.8.1 O documento de identificação deverá estar em perfeitas condições de uso.\n5.7.8.2. O ingresso na sala de aplicação das provas será permitido somente aos candidatos com inscrições\nhomologadas e que apresentarem algum dos seguintes documentos de identificação: Cédula ou Carteira de Identidade\nexpedida por Secretarias de Segurança Pública, Forças Armadas, Polícia Civil e Polícia Federal; Identidade expedida\npelo Ministério da Justiça; Identidade fornecida por Ordens ou Conselho de Classe; Carteira de Trabalho e Previdência\nSocial ou Carteira Nacional de Habilitação; Certificado de Dispensa de Incorporação; Certificado de Reservista;\nPassaporte; Carteira Funcional do Ministério Público.\n5.7.8.3. Somente serão aceitos documentos de identificação inviolados, com foto e assinatura, que permita o\nreconhecimento do candidato, e que contenham o número de registro ou CPF, para fins de identificação.\n5.7.8.4. Serão aceitos os seguintes documentos digitais: CNH e RG, Carteira de Identidade Nacional - CIN e Carteira\nde Ordens ou Conselhos, desde que apresentados nos respectivos aplicativos oficiais, no ato da identificação.\n5.7.8.4.1. A FUNDATEC não aceitará capturas de tela, foto de documento, arquivos em pdf ou impressões.\n5.7.4.4.2. Não será aceito documento exportado previamente através do próprio aplicativo.\n5.7.8.4.3. Ressalta-se que, após a identificação, ao entrar na sala de prova, o uso do celular é proibido, devendo o\naparelho estar desligado e lacrado.\n5.7.8.3. Não serão aceitos como documentos de identificação: certidões de nascimento, títulos eleitorais, carteiras de\nestudante, carteiras funcionais sem valor de identidade. Não será aceita cópia do documento de identificação, ainda\nque autenticada, nem protocolo de solicitação do documento.\n5.7.8.3. Durante a Prova Online, será permitido aos candidatos utilizar no máximo 3 (três) folhas em branco para\nrascunho, e elas serão vistoriadas pelos fiscais, de forma remota, antes do início da prova.\n5.7.8.3.1. Durante a realização da prova, o fiscal pode entrar em contato com o candidato, remotamente pedindo-lhe\nque mostre tais folhas, via webcam, para averiguação de conteúdo.\n5.7.8.3.2. Durante a prova o candidato terá, na própria plataforma, um espaço para rascunho eletrônico.\n5.7.10. O candidato terá 04 (quatro) horas para a resolução da prova. Após, é necessário enviar sua prova seguindo\nas orientações sistema especificamente para essa funcionalidade.\n5.7.10.1. A não realização desta etapa elimina automaticamente o candidato do certame\n5.7.11. O horário de realização da prova será controlado a partir de um cronômetro virtual que encerrará a aplicação\nquando o tempo limite for atingido.\n5.7.12. Durante a realização da prova, o candidato terá sua participação monitorada por vídeo e áudio, inclusive o fiscal\nterá acesso a área de trabalho do computador do candidato (proctoring). Dessa forma, o seu aparelho deve estar\ndisponível para compartilhamento da câmera, microfone e da tela da prova a partir das configurações de segurança.\n5.7.12.1 A câmera filmará o candidato durante toda a realização da prova e fará capturas de imagem para avaliação e\nreconhecimento facial do candidato.\n5.7.12.2 Os áudios e imagens de vídeos registrados serão para uso restrito da FUNDATEC e da SBC, e não serão\ndivulgados sob nenhuma hipótese.\n5.7.13. Durante a realização da prova online, o candidato deverá estar, obrigatoriamente, sozinho no ambiente de prova\ne não poderá acessar outras páginas da internet, nem utilizar qualquer tipo de aparelho eletrônico extra, tais como\ncelular, tablet, etc.\n5.7.13.1. Não é permitido, durante o uso da plataforma e no período de realização da prova:\na) Uso de fone de ouvido durante a aplicação da prova;\nb) Abrir ou utilizar outros programas, ferramentas ou abas enquanto estiver com acesso ativo na plataforma de\nprovas;\nc) Clicar fora da aba da prova e permanecer fora dela por mais de 30 (trinta) segundos;\nd) Clicar por 3 (três) vezes fora da aba da prova;\ne) Utilizar quaisquer atalhos (ctrl+F, ctrl+C, ctrl+V, print screen, etc);\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n12 | Página\nf) Uso de 2 (duas) telas.\n5.7.13.2. Não será permitida, durante a realização da prova, a comunicação entre candidatos nem a utilização de\nmáquinas calculadoras e/ou similares; livros, anotações, réguas de cálculo, impressos ou qualquer outro material de\nconsulta.\n5.7.13.3. Não será admitido, durante a realização da prova, o uso de máscaras, boné, lenço, chapéu, gorro ou qualquer\noutro acessório que cubra as orelhas do candidato ou dificulte o reconhecimento facial. São proibidos também o uso\nde fones de ouvido e headphones.\n5.7.13.3.1 É garantida a liberdade religiosa dos candidatos inscritos. Todavia, em razão dos procedimentos de\nsegurança previstos neste Edital, previamente ao início da prova, aqueles que trajarem vestimentas que restrinjam a\nvisualização das orelhas ou da parte superior da cabeça serão orientados a realizar procedimento de vistoria, com a\ndevida reserva e respeito à intimidade do candidato, a fim de garantir a necessária segurança na aplicação das provas,\nsendo o fato passível de registro em ata.\n5.7.14. O microfone fará gravação do áudio captado durante a realização da prova e será utilizado para o monitoramento\ne avaliação do candidato.\n5.7.15. Antes do início da prova o candidato é instruído, por meio da plataforma e com o acompanhamento de um fiscal\nonline, a girar a câmera do notebook ou webcam, sendo solicitado que mostre a mesa, a parte inferior da mesa e todo\no ambiente ao redor.\n5.7.15.1. A qualquer momento, durante a realização das provas, também poderá ser solicitado que o candidato mostre\na mesa, a parte inferior da mesa e todo o ambiente ao redor.\n5.7.16. Iniciada a prova, o candidato não poderá, de forma alguma, se ausentar da captação de imagem e áudio sem\na autorização do fiscal, sob pena de ser eliminado do processo seletivo.\n5.7.17. A prova será finalizada após a submissão dos itens na plataforma, ou ao término do tempo máximo para\nrealização.\n5.7.18. Não será permitida a interferência ou participação de outras pessoas durante a realização da prova online.\n5.7.19. A FUNDATEC, por meio da ferramenta de aplicação das provas, contará com fiscalização/monitoramento\nremoto ao vivo da realização dos exames (proctoring), podendo o fiscal comunicar-se em tempo real com o candidato\nem caso de irregularidades. Eventuais intercorrências ainda que verificadas após a realização da prova, por meio do\nrelatório do fiscal e da análise das imagens, sons e gravação de tela de prova do candidato, poderão implicar na\neliminação do candidato do processo seletivo.\n5.7.20. Tendo em vista as características do exame e considerando as orientações dos órgãos competentes (Polícia\nFederal, entre outros), a Instituição reserva-se o direito de utilizar identificadores de “IP”, rastreadores de\ncomportamento de teclado e mouse, ferramentas de identificação facial, entre outras providências necessárias à\nperfeita realização do exame.\n5.7.21. Para efeito de auditoria e aplicação do sistema antifraudes de verificação de respostas, as provas poderão ter\nseu conteúdo comparado umas com as outras e, se necessário, as imagens gravadas da tela do candidato durante a\nrealização da prova serão analisadas.\n5.7.22. As condições estruturais do local em que o candidato estará realizando a prova, bem como condições climáticas\nou meteorológicas desfavoráveis na data de realização da prova, não servirão de motivos para tratamentos\ndiferenciados, mudança de horário ou realização de nova prova. Tampouco, serão considerados como razão de\nrecursos e alegação de motivo de baixo desempenho do candidato.\n5.7.23.1 Para ir ao banheiro o candidato deve solicitar ao fiscal pelo chat e aguardar a liberação. Ressalta-se que não\nhaverá compensação do tempo de prova sob nenhuma circunstância\n5.7.24. Alterações fisiológicas tais como: baixa pressão, excesso de suor, períodos menstruais, câimbras, etc.; e\ncompromissos pessoais, também não serão considerados para alteração ou prorrogação dos horários de prova.\n5.7.25. Será eliminado do processo seletivo o candidato que, durante a prova:\na) Utilizar celulares para qualquer finalidade;\nb) não apresentar documento de identificação conforme exigido neste Edital;\nc) Utilizar ou tentar utilizar meios fraudulentos e(ou) ilegais para obter vantagens para si e(ou) para terceiros;\nd) Ausentar-se da frente da câmera, sem a devida autorização do fiscal de sala ONLINE;\ne) for surpreendido, em ato flagrante, durante a realização da prova, comunicando-se com outra pessoa, bem\ncomo utilizando-se de consultas não permitidas, de celular ou de outro equipamento de qualquer natureza;\nf) For surpreendido, em ato flagrante, durante a realização da prova, comunicando-se com outro candidato, dando\nou recebendo auxílio para execução, bem como utilizando-se de consultas não permitidas, de celular ou de outro\nequipamento de qualquer natureza;\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n13 | Página\ng) realizar qualquer registro fotográfico, seja por quaisquer meios, após sua identificação;\nh) Fumar durante a realização da prova;\ni) Tratar com descortesia qualquer dos examinadores, executores, fiscais ou autoridades que estarão\nacompanhando a prova;\nj) For surpreendido com imagens que violem ou infrinjam os direitos de outra pessoa e/ou que contenham\nconteúdo sexual explícito, nudez, conteúdo obsceno, violento ou outros conteúdos censuráveis ou inapropriados.\nk) agir de forma racista, homofóbica, xenofóbica ou qualquer forma de preconceito com outros candidatos,\nfiscais/equipe de aplicação ou qualquer pessoa que esteja no ambiente de prova;\nl) Descumprir as normas contidas neste edital, no todo ou em parte, e(ou) outros que vierem a ser publicados;\nm) apresentar-se para realização de provas e exames com sinais de embriaguez e outras substâncias\nentorpecentes.\n5.7.25.1 O candidato eliminado não constará na lista de divulgação de notas.\n5.7.26. Se, a qualquer tempo, for constatado, por meio eletrônico, estatístico, visual, grafológico e(ou) por meio de\ninvestigação policial, ter o candidato utilizado de processo ilícito, sua prova será anulada e ele será automaticamente\neliminado do processo seletivo.\n5.7.27. Não haverá, por qualquer motivo, prorrogação do tempo previsto para a aplicação das provas em razão de\nafastamento do candidato da sala de provas, salvo os casos previstos neste edital.\n5.7.28. A condição de saúde do candidato no dia da aplicação da prova não será de responsabilidade da FUNDATEC.\nCaso exista a necessidade do candidato se ausentar para atendimento médico ou hospitalar, o mesmo não poderá\nretornar a sua sala online, sendo eliminado do Processo Seletivo.\n\n6. DOS RESULTADOS\n6.1. Os resultados serão disponibilizados no site da FUNDATEC (www.fundatec.org.br).\n6.2. Estão previstos os seguintes resultados/atos, cujas datas de divulgação constam no cronograma do Exame\nPOSCOMP 2025:\na) resultado dos pedidos de isenção do pagamento da taxa de inscrição (preliminar e definitivo);\nb) homologação das inscrições (preliminar e definitivo);\nc) gabarito das questões da Prova Teórico-objetiva (preliminar e definitivo);\nd) notas da Prova Teórico-objetiva (preliminar e definitiva);\ne) visualização da Grade de respostas da Prova Teórico-objetiva;\nf) resultado do Exame POSCOMP.\n6.3. O resultado do Exame POSCOMP 2025 será a soma dos pontos obtidos em cada questão da Prova Teórico-\nobjetiva.\n6.4. O resultado final será disponibilizado, individualmente, no dia determinado no cronograma de execução, no site da\nFUNDATEC (www.fundatec.org.br), com os seguintes dados: número de questões certas, grau de dificuldade das\nquestões, média e desvio padrão por área de conhecimento.\n6.5. Não terão acesso ao Boletim de Desempenho os candidatos que forem eliminados do Exame POSCOMP 2025,\nem virtude da aplicação de quaisquer penalidades que constam do subitem 5.7.27 deste Edital ou que possuam teor\nsimilar, ou que forem ausentes.\n\n7. DOS RECURSOS\n7.1. Os pedidos de recursos terão o prazo previsto no Cronograma de Execução.\n7.2. Será assegurado ao candidato o direito de interpor recurso contra:\na) o resultado preliminar da isenção do pagamento da taxa de inscrição;\nb) o resultado da homologação das inscrições;\nc) o gabarito preliminar e/ou formulação das questões;\nd) a nota preliminar da Prova Teórico-objetiva.\n7.3. Os recursos e pedidos de revisão deverão ser encaminhados e protocolados pelo Formulário Online, que será\ndisponibilizado no site da FUNDATEC (www.fundatec.org.br) e enviados a partir da 0 hora do primeiro dia previsto no\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n14 | Página\nCronograma de Execução até as 17 (dezessete) horas do último dia previsto para encerramento do respectivo prazo,\nconforme cronograma, obedecendo aos mesmos regramentos contidos neste Edital.\n7.4. Não serão considerados os recursos Online que deixarem de ser concretizados por falhas de computadores,\ncongestionamento de linhas ou outros fatores de ordem técnica.\n7.5. Para apresentação de recurso o candidato deverá:\na) fundamentar, argumentar com precisão lógica, com consistência, com concisão e instruir o recurso,\ndevidamente, com material bibliográfico apropriado ao embasamento, quando for o caso, e com a indicação\nprecisa daquilo em que se julgar prejudicado;\nb) Ser claro, consistente e objetivo em seu recurso;\nc) não se identificar no corpo do recurso contra o gabarito preliminar da prova Teórico-objetiva, sob pena de não\nter seu recurso avaliado.\n7.6. Será indeferido, liminarmente, o pedido de recurso inconsistente e/ou fora das especificações estabelecidas neste\nEdital.\n7.6.1. Recursos com teor idêntico/assemelhado ou ofensivo não serão considerados.\n7.6.2. Recursos cuja fundamentação teórica seja baseada na Wikipédia serão indeferidos;\n7.7. Todos os recursos serão analisados, e as justificativas da manutenção/alteração serão divulgadas no site da\nFUNDATEC, www.fundatec.org.br.\n7.7.1. Referente às justificativas da manutenção/alteração dos gabaritos da Prova Teórico-Objetiva, não serão\nencaminhadas respostas individuais aos candidatos.\n7.8. Se houver alteração do gabarito preliminar da Prova Teórico-objetiva, por força de impugnações ou correção, a será\nconsiderado para fins de pontuação o gabarito definitivo.\n7.9. Os pontos relativos à questão eventualmente anulada, e em caso de alteração de gabarito preliminar em virtude dos\nrecursos interpostos, serão válidos para todos os candidatos que realizaram a prova, independentemente de terem ou\nnão recorrido.\n7.9.1. Mediante anulação de questões, em hipótese alguma, haverá alteração do quantitativo de questões aplicadas.\n7.10. A FUNDATEC se reserva o direito de anular questões ou de alterar gabarito, independentemente de recurso,\nconsiderando a possibilidade de equívoco na digitação dos gabaritos, na formulação de questões ou de suas respostas\nou de suas justificativas.\n7.11. Constatada, pela FUNDATEC, irregularidade que culmine em alteração de um gabarito de alguma questão da Prova\nTeórico-objetiva após a publicação do gabarito definitivo, será publicado gabarito definitivo retificativo e a justificativa\npara alteração. No entanto, se o erro for constatado e divulgado após a publicação das notas preliminares, a questão\nirregular terá o seu gabarito como anulado, independentemente de haver alternativa correta.\n7.12. Será disponibilizada a consulta às Grades de Respostas e aos Formulários de Avaliação, quando houver, no site\nda FUNDATEC (www.fundatec.org.br), mediante acesso por CPF e senha.\n7.13. As imagens disponibilizadas virtualmente, tais como Grades de Avaliação, Grades de Respostas e Folhas\nDefinitivas, deverão ser consultadas, preferencialmente, no dia em que forem disponibilizadas.\n7.14. Para manifestação referente as notas preliminares da Prova Teórico-objetiva, o candidato deverá consultar sua\nGrade de Respostas verificando o Gabarito Definitivo publicado, bem como a possível irregularidade na leitura do\nformulário ocasionado pela falta de atenção às orientações determinadas por este edital e demais materiais\ncomplementares.\n7.15. Caso tenha dificuldade em acessar as imagens e haja necessidade delas para interpor recurso, o candidato deverá\nentrar em contato com a FUNDATEC pelos canais de comunicação disponíveis no site da Instituição\nwww.fundatec.org.br, até o dia anterior ao término do período de recurso, para verificação/regularização da situação pela\nFUNDATEC.\n7.16. Eventuais dificuldades de acesso/visualização das imagens não serão aceitas como motivo para o candidato não\nse manifestar durante o período de recurso.\n7.17. As imagens ficarão disponíveis para acesso pelo prazo de 30 (trinta) dias após a sua publicação.\n7.18. Encerrado o prazo determinado acima, não será concedida outra forma de acesso às imagens, seja qual for o\nmotivo alegado pelo candidato, salvo determinação judicial.\n7.19. Constatada, pela FUNDATEC, independentemente de recurso, qualquer irregularidade que culmine em alteração\nda nota do candidato, seja para maior ou para menor da preliminarmente divulgada, será publicada justificativa para tal\nalteração.\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n15 | Página\n7.20. O candidato terá até 24 (vinte e quatro) horas, após a divulgação das justificativas para manutenção/alteração dos\nresultados, para manifestação ou questionamento dos pareceres publicados. A manifestação deverá ser realizada\natravés do e-mail requerimento.adm@fundatec.org.br, considerando os seguintes critérios:\na) serão analisadas as contestações dos candidatos que recursaram no prazo determinado no Cronograma de\nExecução, à exceção dos casos de alteração de gabarito preliminar da Prova Teórico-Objetiva ou que se\nconsiderarem prejudicados por alguma alteração de nota.\nb) manifestações de candidatos que não recursaram nos prazos determinados serão consideradas intempestivas,\nsendo assim, o candidato perde o direito de contestação dos resultados.\nc) as manifestações referidas nesse item não serão respondidas individualmente.\nd) caso as alegações sejam procedentes, haverá atualização das justificativas para manutenção/alteração dos\nresultados no prazo de 48 (quarenta e oito) horas.\ne) encerrado o prazo estabelecido na alínea anterior, subentende-se que permanecerá como resposta o disposto\nnas justificativas para manutenção/alteração dos resultados já publicados.\n7.21. Recursos e argumentações apresentados fora das especificações estabelecidas neste Edital não serão analisados.\n\n8. DAS DISPOSIÇÕES FINAIS\n8.1. A inscrição do candidato ao Exame POSCOMP 2025 implica o conhecimento e a aceitação tácita das condições\nestabelecidas no presente Edital, das quais ele não poderá alegar desconhecimento.\n8.2. Todos os formulários online, disponibilizados no site da FUNDATEC, estarão disponíveis até às 17 (dezessete)\nhoras do último dia previsto para encerramento do respectivo prazo.\n8.2.1. Os prazos estabelecidos neste Edital são preclusivos, contínuos e comum a todos os candidatos, não havendo\njustificativa para o não cumprimento e para apresentação de documentos após as datas estabelecidas.\n8.3. Todas as alterações realizadas por meio de Editais Retificativos ou Adendos, poderão ser inseridas no Edital de\nAbertura, constante na página principal do certame, no site da Fundatec, em cor de destaque, para que seja possível\no acompanhamento do Edital de Abertura alterado na íntegra, contudo, é de responsabilidade do candidato acompanhar\nos editais complementares a parte.\n8.4. As disposições e instruções contidas na página da internet, nas capas dos cadernos de provas, nos Editais e avisos\noficiais divulgados pela FUNDATEC no site (www.fundatec.org.br), ou em qualquer outro veículo de comunicação,\nconstituirão normas que passarão a integrar o presente Edital.\n8.5. As datas das provas dos Processos Seletivos/ Concursos executados pela Fundatec são independentes e\nrealizadas, para cada instituição, de acordo com os cronogramas divulgados em seus próprios Editais de Abertura.\nSendo assim, não há possibilidade de alteração dos cronogramas em virtude de avaliações realizadas em datas\nconcomitantes.\n8.6. Os Editais e Avisos referentes a esse Exame serão divulgados no site www.fundatec.org.br.\n8.7. Atestados, certificados, documentos comprobatórios, etc., encaminhados pelos candidatos durante esse certame,\nnão serão disponibilizados posteriormente.\n8.8. O candidato declara seu consentimento de que, por se tratar de um Processo Seletivo Público, os seus dados (nome,\nnúmero de inscrição), bem como os resultados de todas as etapas serão publicizados nos sites da SBC e da FUNDATEC,\npor meio de editais e listagens do referido certame.\n8.8.1. A FUNDATEC e a SBC se obrigam a realizar o tratamento de dados pessoais, de acordo com as disposições legais\nvigentes, especialmente a Lei nº 13.709/2018 (LGPD), envolvendo operações referentes à coleta, produção, recepção,\nclassificação, utilização, acesso, reprodução, transmissão, distribuição, processamento, arquivamento, armazenamento,\neliminação, avaliação ou controle da informação, modificação, comunicação, transferência, difusão ou extração.\n8.8.2. O candidato, sendo o titular dos dados pessoais, autoriza a FUNDATEC a realizar o tratamento dos dados para os\nfins de cumprimento de obrigações decorrentes da legislação e, ao se inscrever nesse certame, declara seu expresso\nconsentimento para que seus dados sejam tratados e processados, sendo utilizados tão somente para os fins necessários\nda execução desse Processo Seletivo durante as etapas determinadas neste Edital de Abertura.\n8.8.2.1. Os dados referentes a publicações previstas no cronograma, aos formulários de presença, as avaliações e\nconvocações que se façam necessárias em cada fase, serão de acesso da FUNDATEC e da SBC, e poderão ser\ncompartilhados para cumprimento de exigências legais, regulatórias ou fiscais de acordo com andamento do certame.\n8.8.3. A FUNDATEC e a SBC ficam autorizadas a compartilhar os dados pessoais do candidato com outros agentes de\ntratamento de dados, caso seja necessário para as finalidades listadas neste instrumento, desde que sejam respeitados\nos princípios da boa-fé, finalidade, adequação, necessidade, livre acesso, qualidade dos dados, transparência,\nsegurança, prevenção, não discriminação, responsabilização e prestação de contas.\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n16 | Página\n8.9. Será eliminado do Exame o candidato que fizer, em qualquer documento, declaração falsa ou inexata. A inexatidão\ndas informações, irregularidades dos documentos ou não comprovação deles no prazo solicitado pela SBC, ainda que\nverificadas posteriormente, eliminarão o candidato do Exame, anulando-se todos os atos decorrentes de sua inscrição.\n8.10. A FUNDATEC encaminha e-mails meramente informativos ao candidato para o endereço eletrônico fornecido na\nficha de inscrição, o que não isenta o candidato de buscar as informações nos locais informados no Edital. O site da\nFUNDATEC (www.fundatec.org.br), será fonte permanente de comunicação de avisos e editais.\n8.11. Caberá à FUNDATEC a homologação do resultado final do Exame.\n8.12. Não serão dadas, por telefone, informações a respeito de datas e horários de realização das provas, nem de\nresultados, gabaritos, notas, classificação, convocações ou outras quaisquer relacionadas aos resultados preliminares\nou finais das provas e do Exame. O candidato deverá observar rigorosamente os editais e os comunicados a serem\ndivulgados.\n8.13. A SBC e a FUNDATEC não se responsabilizam por informações cadastradas de:\n- endereço incorreto, incompletos desatualizado ou de difícil acesso;\n- endereço eletrônico (e-mail) incorreto, incompleto ou desatualizado;\n- problemas do endereço eletrônico (e-mail) do candidato, tais como: caixa de correio cheia, filtros de anti-spam,\netc.\n8.14. O candidato deverá manter seu endereço atualizado junto à FUNDATEC enquanto estiver participando do Exame\naté a publicação do Boletim de Desempenho. Após, os candidatos classificados deverão manter os dados de contato\natualizados junto a SBC pelo e-mail sbc@sbc.org.br ou pelo telefone (51) 3308-6835. São de exclusiva responsabilidade\ndo candidato os prejuízos advindos da não atualização de seu endereço.\n8.15. Todas as despesas referentes aos deslocamentos, hospedagem e alimentação dos candidatos correrão por sua\nprópria conta, eximindo-se a FUNDATEC e a SBC da responsabilidade por essas despesas e outras decorrentes,\ninclusive no caso de eventual reaplicação de provas.\n8.16. Será fornecido certificados de participação no Exame aos candidatos, disponibilizado no site da FUNDATEC\n(www.fundatec.org.br).\n8.17. Os candidatos ficam cientes de que a SBC poderá divulgar a empresas e parceiras o ranking dos candidatos no\nExame POSCOMP.\n8.18. Os documentos referentes a este exame ficarão sob a guarda da FUNDATEC até a publicação do Boletim de\nDesempenho do Exame, sendo posteriormente repassados à SBC via ofício.\n8.19. Qualquer ação judicial decorrente deste Exame deverá ser ajuizada no Foro da Comarca de Porto Alegre/RS,\nexcluindo-se qualquer outro Foro.\n8.20. Será admitida a impugnação deste Edital, que deverá ser encaminhada exclusivamente através de Formulário\nOnline, devidamente fundamentada, no prazo estabelecido no Cronograma de Execução.\n8.20.1 As respostas serão encaminhadas individualmente ao requerente e, caso a Comissão de Concurso da\nFUNDATEC e da SBC verificarem a necessidade de alterações deste Edital, serão publicados no site da FUNDATEC,\nEditais retificativos e/ou complementares.\n8.21. Os casos omissos serão resolvidos pela Comissão de Concurso da FUNDATEC em conjunto com a Comissão de\nConcurso da SBC.\n\n9. ANEXOS\nIntegram este Edital, os seguintes Anexos:\na) Anexo I – PROGRAMA DA PROVA TEÓRICO-OBJETIVA (CONTEÚDOS PROGRAMÁTICOS POR ÁREA\nDE CONHECIMENTO);\nb) Anexo II – CRONOGRAMA.\n\nPorto Alegre, 22 de maio de 2025.\n\n\nThais Batista Vasconcelos\nPresidente da Sociedade Brasileira de Computação.AN\nEXO I – PROGRAMA DA PROVA TEÓRICO-OBJETIVA\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n17 | Página\nANEXO I - CONTEÚDOS PROGRAMÁTICOS POR ÁREA DE CONHECIMENTO\nMATEMÁTICA\nÁlgebra Linear\nSistemas de Equações Lineares: método de eliminação de Gauss para sistemas lineares. Espaços vetoriais.\nSubespaços. Bases. Somas Diretas. Introdução à Programação Linear. Transformações Lineares e Matrizes.\nAutovalores e Autovetores. Diagonalização. Espaços com Produto Interno. Bases Ortonormais. Projeções Ortogonais.\nMovimentos Rígidos. Método dos Mínimos Quadrados. Transformações em Espaços com Produto Interno. O Teorema\nda Representação para Funções Lineares. Adjunta de uma Transformação Linear. Operadores Simétricos, Unitários,\nOrtogonais e Normais. O Teorema Espectral. Formas Canônicas.\nAnálise Combinatória\nDistribuição. Permutações. Combinações. Funções Geradoras Ordinárias e Exponenciais. Princípio de Inclusão e\nExclusão. Enumeração de Partições, Grafos, Árvores e Redes. Enumeração por Recursão. Permutações com Posições\nRestritas.\nCálculo Diferencial e Integral\nLimites de Funções e de Sequências. Funções Reais de uma Variável: Continuidade e Diferenciabilidade. Máximos e\nMínimos. Fórmula de Taylor e Aproximação de Funções. Método de Newton para o Cálculo de Raízes e de Máximos e\nMínimos. Integração de Funções Reais de uma Variável. Métodos de Integração. Integração Aproximada. Regras dos\nTrapézios, de Simpson e Generalizadas. Funções de Várias Variáveis: Continuidade e Diferenciabilidade. Gradiente.\nMáximos e Mínimos. Multiplicadores de Lagrange. Transformações. Matrizes Jacobianas. Teorema da Função Inversa.\nDiferenciação Implícita. Integração de Funções de Várias Variáveis. Mudanças de Coordenadas em Integrais. Integral\nde Linha.\nGeometria Analítica\nMatrizes. Sistemas de Equações Lineares. Vetores. Produtos: escalar, vetorial e misto. Álgebra Vetorial. Reta no plano\ne no espaço. Planos. Posições Relativas, Interseções, Distâncias e Ângulos. Círculo e Esfera. Coordenadas Polares,\nCilíndricas e Esféricas.\nLógica Matemática\nLógica Proposicional e de Predicados. Linguagem Proposicional e de Primeira Ordem. Sistemas Dedutivos. Tabelas\nVerdade e Estruturas de Primeira Ordem. Relações de Consequência. Corretude. Completude. Compacidade.\nLowemhein-Skolem. Decidibilidade. Prova Automática de Teoremas. Lógicas não clássicas.\nMatemática Discreta\nIteração, Indução e Recursão. Conjuntos e Álgebra de Conjuntos como uma Teoria Axiomática. Par Ordenado.\nFunções. Funções e Formas Booleanas, Álgebra Booleana, Minimização de Funções Booleanas. Relações sobre\nConjuntos, Relações de Equivalência e Ordem. Reticulados, Monóides, Grupos, Anéis. Teoria dos Códigos, Canal\nBinário, Canal Simétrico, Código de Blocos, Matrizes Geradoras e Verificadoras, Códigos de Grupo, Códigos de\nHamming. Teoria dos Domínios: Ordens Parciais Completas, Continuidade, Ponto Fixo, Domínios, Espaço das Funções.\nProbabilidade e Estatística\nEventos. Experimentos Aleatórios. Análise Exploratória de Dados. Descrição Estatística dos Dados. Espaços Amostrais.\nProbabilidades em Espaços Amostrais Discretos. Distribuições de Probabilidades de Variáveis Aleatórias\nUnidimensionais e Bidimensionais. Esperança Matemática. Variância e Coeficientes de Correlação. Aproximação\nNormal. Estimação Pontual e por Intervalo. Teste de Hipóteses para Médias. Testes do Qui-Quadrado. Testes de\nComparações de Médias. Regressão e Correlação.\n\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n18 | Página\n\nFUNDAMENTOS DA COMPUTAÇÃO\nAnálise de Algoritmos\nMedidas de Complexidade, Análise Assintótica de Limites de Complexidade, Técnicas de Prova de Cotas Inferiores.\nNotação “Big O”, “Little o”, “Omega” e “Theta”. Medidas Empíricas de Performance. O Uso de Relações de Recorrência\npara Análise de Algoritmos Recursivos. Análise de Algoritmos Iterativos e Recursivos.\nAlgoritmos e Estrutura de Dados\nMetodologia de Desenvolvimento de Algoritmos. Tipos de Dados Básicos e Estruturados. Comandos de uma\nLinguagem de Programação. Recursividade: Conceito e Implementação. Modularidade e Abstração. Estratégias de\nDepuração. Cadeias e Processamento de Cadeias. Estruturas de Dados Lineares e suas Generalizações: Listas\nOrdenadas, Listas Encadeadas, Pilhas e Filas. Árvores e suas Generalizações: Árvores Binárias, Árvores de Busca e\nÁrvores Balanceadas. Tabelas Hash. Algoritmos para Pesquisa e Ordenação. Algoritmos para “Garbage Collection”.\nTécnicas de Projeto de Algoritmos: Método da Força Bruta, Pesquisa Exaustiva, Algoritmo Guloso, Dividir e Conquistar,\n“Backtracking” e Heurísticas.\nArquitetura e Organização de Computadores\nOrganização de Computadores: Memórias, Unidades Centrais de Processamento, Entrada e Saída. Linguagens de\nMontagem. Modos de Endereçamento, Conjunto de Instruções. Mecanismos de Interrupção e de Exceção. Barramento,\nComunicações, Interfaces e Periféricos. Organização de Memória. Memória Auxiliar. Arquiteturas RISC e CISC.\nPipeline. Paralelismo de Baixa Granularidade. Processadores Superescalares e Superpipeline. Multiprocessadores.\nMulticomputadores. Arquiteturas Paralelas e não Convencionais.\nCircuitos Digitais\nSistemas de Numeração e Códigos. Aritmética Binária. Representação e Manipulação de Circuitos Combinatórios.\nMinimização e Otimização de Funções Combinatórias. Projeto de Circuitos Combinatórios. Análise e Síntese de\nComponentes Sequenciais e de Memória. Projeto de Circuitos Sequenciais. Modelo de Máquinas de Estado Finito\n(FSM). Circuitos Sequenciais Síncronos e Assíncronos. Componentes de Armazenamento. Projeto de Sistemas Digitais:\nHierárquico e Modular. Princípios e Técnicas de Projeto. Conceitos de Controle e de Tempo. Famílias Lógicas.\nDispositivos Lógicos Programáveis (PLD).\nLinguagens de Programação\nConceitos. Paradigmas de Linguagens de Programação. Semântica Formal. Teoria dos Tipos: Sistemas de Tipos,\nPolimorfismo. Verificação e Inferência de Tipos.\nLinguagens Formais, Autômatos e Computabilidade\nGramáticas. Linguagens Regulares, Livres-de-Contexto e Sensíveis-ao-Contexto. Tipos de Reconhecedores.\nOperações com Linguagens. Propriedades das Linguagens. Autômatos de Estados Finitos Determinístico e não\nDeterminístico. Autômatos de Pilha. Máquina de Turing. Hierarquia de Chomsky. Funções Recursivas. Tese de Church.\nProblemas Indecidíveis. Teorema da Incompletude de Godel. Classes de Problemas P, NP, NP Completo e NP-Difícil.\nMétodos de Redução de Problemas.\nOrganização de Arquivos e Dados\nOrganização, Estrutura e Operação de Arquivos. Diretórios: Conteúdo e Estrutura. Arquivos do Sistema e Sistema de\nArquivos Virtuais. Técnicas de Pesquisa. Dados e Metadados. Representação Digital e Analógica. Algoritmos de\nCodificação e Decodificação. Compressão de Dados, Áudio, Imagem e Vídeo.\nSistemas Operacionais\nConceito de Processo. Gerência de Processos/Processador. Comunicação, Concorrência e Sincronização de\nProcessos. Gerenciamento de Memória: Memória Virtual, Paginação, Segmentação e “Swap”. Gerenciamento de\nArquivos. Gerenciamento de Dispositivos de Entrada/Saída. Alocação de Recursos.\nTécnicas de Programação\nDesenvolvimento de algoritmos. Tipos de dados básicos e estruturados. Comandos de uma Linguagem de programação.\nMetodologia de desenvolvimento de programas. Modularidade e abstração.\nTeoria dos Grafos\nGrafos orientados e não-orientados. Caminhos. Planaridade. Conectividade. Coloração. Grafos Infinitos. Algoritmos em\ngrafos. Problemas intratáveis. Busca em Largura e Profundidade. Algoritmos do Menor Caminho. Árvore Geradora.\nOrdenação Topológica.\n\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n19 | Página\nTECNOLOGIA DE COMPUTAÇÃO\nBanco de Dados\nModelo de Dados. Modelagem e Projeto de Banco de Dados. Sistemas de Gerenciamento de Bancos de Dados (SGBD):\nArquitetura, Segurança, Integridade, Concorrência, Recuperação após Falha, Gerenciamento de Transações.\nLinguagens de Consulta. Bancos de Dados Distribuídos. Mineração de Dados.\nCompiladores\nCompiladores e Interpretadores. Análise Léxica e Sintática. Tabelas de Símbolos. Esquemas de Tradução. Ambientes\nde Tempo de Execução. Representação Intermediária. Análise Semântica. Geração de Código. Otimização de Código.\nBibliotecas e Compilação em Separado.\nComputação Gráfica\nTransformações Geométricas em Duas e Três Dimensões: Coordenadas Homogêneas e Matrizes de Transformação.\nTransformação entre Sistemas de Coordenadas 2D e Recorte. Transformações de Projeção Paralela e Perspectiva.\nCâmera Virtual. Transformação entre Sistemas de Coordenadas 3D. Definição de Objetos e Cenas Tridimensionais:\nModelos Poliedrais e Malhas de Polígonos. O Processo de “Rendering”: Fontes de Luz, Remoção de Linhas e\nSuperfícies Ocultas, Modelos de Tonalização (“Shading”). Aplicação de Texturas. O problema do Serrilhado (“Aliasing”)\ne Técnicas de Anti-Serrilhado (“Antialiasing”). Visualização.\nEngenharia de Software\nProcesso de Desenvolvimento de Software. Ciclo de Vida de Desenvolvimento de Software. Qualidade de Software.\nTécnicas de Planejamento e Gerenciamento de Software. Gerenciamento de Configuração de Software. Engenharia de\nRequisitos. Métodos de Análise e de Projeto de Software. Garantia de Qualidade de Software. Verificação, Validação e\nTeste. Manutenção. Documentação. Padrões de Desenvolvimento. Reuso. Engenharia Reversa. Reengenharia.\nAmbientes de Desenvolvimento de Software.\nInteligência Artificial\nLinguagens Simbólicas. Programação em Lógica. Resolução de Problemas como Busca. Estratégias de Busca, Busca\nCega e Busca Heurística. Hill climbing, best first, simulated annealing e Algoritmo A*. Busca como Maximização de\nFunção. Grafos And/Or. Esquemas para Representação do Conhecimento: Lógicos, em Rede, Estruturados,\nProcedurais. Sistemas de Produção com Encadeamento para a Frente e Encadeamento para trás. Raciocínio Não-\nMonotônico. Formalismos para a Representação de Conhecimento Incerto. A Regra de Bayes. Conjuntos e Lógica\nFuzzy. Aprendizado de Máquina. Aprendizado Indutivo. Árvores de Decisão, Redes Neurais e Algoritmos Genéticos.\nSistemas Especialistas. Processamento de Linguagem Natural. Agentes Inteligentes. Robótica.\nProcessamento de Imagens\nIntrodução aos Filtros Digitais. Métodos de Espaço de Estados. Noções de Percepção Visual Humana. Amostragem e\nQuantização de Imagens. Transformadas de Imagens. Realce. Filtragem e Restauração. Reconstrução Tomográfica de\nImagens. Codificação. Análise de Imagens e Noções de Visão Computacional. Reconhecimento de Padrões.\nRedes de Computadores\nTipos de Enlace, Códigos, Modos e Meios de Transmissão. Protocolos e Serviços de Comunicação. Terminologia,\nTopologias, Modelos de Arquitetura e Aplicações. Especificação de Protocolos. Internet e Intranets. Interconexão de\nRedes. Redes de Banda Larga. Segurança e Autenticação. Avaliação de Desempenho.\nSistemas Distribuídos\nProblemas Básicos em Computação Distribuída: Coordenação e Sincronização de Processos, Exclusão Mútua, Difusão\nde Mensagens. Compartilhamento de Informação: Controle de Concorrência, Transações Distribuídas. Comunicação\nentre Processos. Tolerância a Falhas. Sistemas Operacionais Distribuídos: Sistemas de Arquivos, Servidores de Nomes,\nMemória Compartilhada, Segurança.\n\n\n\n\n\n\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n20 | Página\nANEXO II – CRONOGRAMA\nPROCEDIMENTOS DATA\nPublicação do Edital de Abertura 22/05/2025\nPeríodo de Inscrições pela internet, através do site www.fundatec.org.br 22/05 a 08/07/2025\nPeríodo para impugnação do Edital de Abertura 22/05 a 31/05/2025\nPeríodo para Solicitação de Isenção da Taxa de Inscrição 23 a 26/05/2025\nEdital de Resultado dos Pedidos de Isenção da Taxa de Inscrição 02/06/2025\nPeríodo de Recebimento de Recursos Administrativos do Resultado dos Pedidos de Isenção da\nTaxa de Inscrição\n03 a 05/06/2025\nEdital de Resultado dos Pedidos de Isenção da Taxa de Inscrição após Recurso 12/06/2025\nÚltimo dia para entrega do Laudo Médico e Documentos Complementares dos candidatos que\nsolicitaram atendimento especial para o dia de prova\n09/07/2025\nÚltimo dia para efetuar o Pagamento do Boleto Bancário 09/07/2025\nÚltimo dia para alteração das fotos que não foram aceitas, ou seja, que não estão de acordo\npara fins de identificação no dia de prova\n09/07/2025\nEdital de Publicação das Inscrições Homologadas – Lista Preliminar de Inscritos 12/08/2025\nPeríodo de Recursos Administrativos do Homologação Preliminar das Inscrições, Período de\nSolicitação de Correção de Dados Cadastrais e Formulário Online – Comprovação de Laudo\nMédico e/ou Atendimento Especial para recurso\n13 a 15/08/2025\nEdital de Publicação das Inscrições Homologadas – Lista Definitiva de Inscritos após análise\ndos recursos\n22/08/2025\nDivulgação da Densidade de Inscritos por cargo 22/08/2025\nEdital de Data e Hora da Prova Teórico-Objetiva 22/08/2025\nDivulgação do Link de Acesso a Prova Teórico-Objetiva Online 22/08/2025\nAplicação da Prova Teórico-Objetiva Online – às 9h, conforme Horário Oficial de Brasília 31/08/2025\nEdital de Divulgação do Gabarito Preliminar da Prova Teórico-Objetiva 01/09/2025\nPublicação do Modelo de Prova Teórico-Objetiva aplicada 01/09/2025\nPeríodo de Recebimento de Recursos Administrativos dos Gabaritos Preliminares da Prova\nTeórico-Objetiva\n02/09 a 04/09/2025\nÚltimo dia para envio das documentações de Atendimentos Especiais intempestivos,\nIdentificação Especial e correções de dados cadastrais, através do Formulário Online\n08/09/2025\nEdital de Divulgação do Gabarito Definitivo das Prova Teórico-Objetiva 17/09/2025\nEdital de Divulgação das Justificativas para Manutenção/Alteração do Gabarito Preliminar da\nProva Teórico-Objetiva\n17/09/2025\nEdital de Notas Preliminares da Prova Teórico-Objetiva 22/09/2025\nDisponibilização das Grades de Respostas da Prova Teórico-Objetiva no site da FUNDATEC 22/09/2025\nPeríodo para emissão do Atestado de comparecimento na Prova Teórico-Objetiva\n22/09 a 22/10/2025\nPeríodo de Recebimento de Recursos Administrativos das Notas Preliminares da Prova Teórico-\nObjetiva\n23/09 a 25/09/2025\nEdital de Notas Definitivas das Prova Teórico-Objetiva 01/10/2025\nEdital de Divulgação das Justificativas para Manutenção/Alteração das Notas Preliminares da\nProva Teórico-Objetiva\n01/10/2025\nBoletim de Desempenho\n07/10/2025\nDisponibilização do Certificado de Participação no Exame 2025\n07/10/2025\nDivulgação das Médias e Desvio Padrão das Prova Teórico-objetiva\n07/10/2025\n\n\n\nExame Nacional para Ingresso na Pós-Graduação em Computação – POSCOMP 2025 - Edital de Abertura nº 001/2025 21/05/2025 18:39 – Rev 05\n21 | Página",
      "pageCount": 21,
      "errorMessage": null,
      "createdAt": "2025-12-08T03:35:56.976Z",
      "updatedAt": "2025-12-08T03:35:57.198Z"
    },
    {
      "id": "bd176061-3189-4c16-8fd8-de77ea0f5f34",
      "userId": "f699d9ec-c69f-4894-8616-146959a7a518",
      "originalName": "projeto_final.pdf",
      "storedName": "9921d215-fe7c-4ed6-a737-5466c9e5a77e.pdf",
      "filePath": "uploads\\f699d9ec-c69f-4894-8616-146959a7a518\\9921d215-fe7c-4ed6-a737-5466c9e5a77e.pdf",
      "fileSize": 80926,
      "mimeType": "application/pdf",
      "status": "processed",
      "extractedText": "Aplicação Web de Resumo de Documentos\n1. Visão Geral do Protótipo da Aplicação\n1.1. Objetivo\nDesenvolvimento de um protótipo de uma aplicação web para gerenciamento e análise de\ndocumentos PDF com capacidade de geração de resumos individuais e integrados utilizando\nmodelos de LLM.\n1.2. Escopo\nSistema completo com autenticação de usuários, upload de arquivos, processamento de\ndocumentos e dashboard principal.\n2. Especificações Funcionais\n2.1. Módulo de Autenticação e Autorização\nRF-001: Sistema de registro e login de usuários\n•Campos obrigatórios: nome completo, username, senha, email\n•Campos opcionais: imagem de perfil, descrição\n•Data de criação automática do usuário\n•Proteção de dados sensíveis e controle de acesso\n2.2. Módulo de Gerenciamento de Arquivos\nRF-002: Upload de documentos PDF\n•Tamanho máximo: 50 MB por arquivo\n•Validação de formato (.pdf)\n•Armazenamento seguro com controle de acesso por usuário\nRF-003: Listagem e seleção de arquivos\n•Seleção individual e múltipla de documentos\n•Opcional: Interface para visualização de todos os arquivos do usuário\n2.3. Módulo de Processamento de Documentos\nRF-004: Resumo de arquivo único\n•Seleção de arquivo PDF\n•Geração de resumo utilizando LLM\n•Armazenamento do resumo gerado\nde 14\n\nRF-005: Resumo integrado de múltiplos arquivos\n•Seleção de múltiplos arquivos PDF\n•Geração de resumo consolidado\n•Armazenamento do resumo integrado\n2.4. Dashboard do Usuário\nRF-006: Interface principal pós-autenticação\n•Menu de navegação\n•Edição de perfil do usuário\n•Acesso rápido às funcionalidades de upload e listagem de arquivos\n•Visualização de documentos e resumos\n3. Especificações Técnicas\n3.1. Arquitetura da Aplicação\nBackend:\n•Tecnologia: Livre escolha (Python/Node.js/Java)\n•Framework web conforme tecnologia escolhida\n•Integração com serviços de LLM\nFrontend:\n•Framework moderno (React/Vue.js/Angular) ou template engine\n•Opcional: Interface responsiva e intuitiva\n3.2. Integração com LLM\nRF-TEC-001: Integração com Modelo de Linguagem\n•Escolha livre de LLM (OpenAI GPT, Google Gemini, Anthropic Claude, ou outros)\n•Uso de framework/API apropriado (LangChain, OpenAI SDK, Google Generative AI, etc.)\n•Tratamento de erros\n3.3. Armazenamento de Dados\nRF-TEC-002: Sistema de persistência\n•Banco de dados para usuários e metadados dos arquivos\n•Armazenamento seguro de arquivos PDF\n•Gestão de resumos gerados\nde 24\n\n4. Especificações de Infraestrutura AWS\n4.1. Rede e Segurança\nINF-001: Configuração de VPC\n•Criação de VPC dedicada para a aplicação\n•Subnets públicas e privadas conforme necessidade\n•Tabelas de rotas configuradas\nINF-002: Grupos de Segurança\n•Regras de entrada e saída restritivas\n•Acesso HTTP/HTTPS (portas 80/443)\n•Acesso SSH restrito para administração do servidor de aplicação\n4.2. Serviços de Computação\nINF-003: Instância EC2\n•Tipo de instância adequado à carga esperada\n•Permitir acesso público da aplicação para acesso via Internet\n5. Critérios de Aceitação\n5.1. Funcionais\n•Usuário consegue se registrar e fazer login\n•Upload de PDF até 50 MB funciona corretamente\n•Listagem de arquivos exibe documentos do usuário\n•Geração de resumo individual funciona\n•Geração de resumo múltiplo funciona\n•Dashboard é acessível após login\n•Edição de perfil funciona corretamente\n5.2. Técnicos\n•Aplicação implantada (deployed) na AWS EC2\n•VPC configurada corretamente\n•Grupos de segurança implementados\n•Acesso via Internet funcionando\n•Integração com LLM operacional\n6. Entregáveis\n6.1. Código e Documentação\n•Repositório GIT com código completo\nde 34\n\n•README.md com instruções de instalação e deploy\n•Documentação técnica da arquitetura (opcional)\n6.2. Apresentação\n•Protótipo funcional demonstrado (20 minutos)\n•Descrição dos passos de implementação\n•Detalhamento da colaboração da equipe\n•Link do repositório compartilhado\n7. Métricas de Sucesso\nMétricas de Performance:\n•Tempo de resposta para geração de resumos: < 30 segundos\nde 44",
      "pageCount": 4,
      "errorMessage": null,
      "createdAt": "2025-12-10T11:40:30.204Z",
      "updatedAt": "2025-12-10T11:40:30.405Z"
    },
    {
      "id": "09eed447-de58-40b3-9264-db14e6fb6c0a",
      "userId": "f699d9ec-c69f-4894-8616-146959a7a518",
      "originalName": "Adenosina.pdf",
      "storedName": "9d54f90c-cc1c-40f7-8d91-1a1d47af611e.pdf",
      "filePath": "uploads\\f699d9ec-c69f-4894-8616-146959a7a518\\9d54f90c-cc1c-40f7-8d91-1a1d47af611e.pdf",
      "fileSize": 228131,
      "mimeType": "application/pdf",
      "status": "processed",
      "extractedText": "Formulário Terapêutico Distrital\n\n\n\nADENOSINA\nRaiane Diniz Oliveira\n\n1. APRESENTAÇÕES PADRONIZADAS E ACESSO\n\n4980 - Adenosina solução injetável 3 mg/ml ampola 2 ml – Uso hospitalar\n2. CLASSE TERAPÊUTICA\n1\n\nOutros preparados cardíacos\n3. INDICAÇÕES\n2\n\nTratamento da taquicardia paroxística supraventricular (TPSV) ao ritmo sinusal, incluindo a\nassociada à síndrome de Wolff-Parkinson-White, visando a reversão ao ritmo sinusal\n3.1 PROTOCOLO SES\nNão se aplica.\n3.2 PROTOCOLO MS\nNão se aplica.\n4. CONTRAINDICAÇÕES\n2,3,4\n\nEste medicamento e contraindicado para bloqueio atrioventricular de segundo e terceiro\ngraus (exceto em pacientes com marcapasso artificial funcionante); e doença do nó sinusial\nou bradicardia sintomática (exceto em pacientes com marcapasso artificial funcionante).\nAlém dessas, também são contraindicadas a pacientes que possuam hipersensibilidade à\nadenosina ou aos demais componentes da formulação e em doença pulmonar obstrutiva\nconhecida ou suspeita (ex: asma).\n5. ADMINISTRAÇÃO E USO\n2,3,4,5\n\n5.1 VIA DE ADMINISTRAÇÃO\nVia endovenosa (EV)\n\n5.2 MODO DE USO\nAdministração endovenosa direta com dose inicial de 6 mg em 1 a 2 s. Caso haja necessidade\nde uma ou duas administrações subsequentes, administrar com intervalo de 1 a 2 minutos\nentre elas. Não é recomendada a administração de doses únicas superiores a 12 mg.\n\nGOVERNO DO DISTRITO FEDERAL\nSECRETARIA DE ESTADO DE SAÚDE\nSUBSECRETARIA DE ATENÇÃO INTEGRAL À SAÚDE\nDIRETORIA DE ASSISTÊNCIA FARMACÊUTICA\n\n\nFormulário Terapêutico Distrital\nEste medicamento deve ser administrado em bolus endovenoso sem diluição, caso haja\nquantidade do medicamento não utilizada esta deve ser imediatamente descartada, uma vez\nque o medicamento não possui conservantes em sua fomulação .\n5.3 CARACTERÍSTICAS DA FORMULAÇÃO\n5.3.1 DISSOLUÇÃO (QUANDO APLICÁVEL) OU COMPATIBILIDADE (QUANDO APLICÁVEL)\nCompatível com SG 5%, SRL e SF 0,9%.\n5.3.2 TECNOLOGIAS DA FORMA FARMACÊUTICA (QUANDO APLICÁVEL)\nNão aplicável\n5.3.3 PROPRIEDADES FISICO-QUÍMICAS E ORGANOLÉPICAS\nA adenosina é um nucleosídeo endógeno presente em todas as células do organismo,\nquimicamente denominada 6-amino-9-beta-Dribofuranosila-9-H-purina, com peso molecular\n267,24 e fórmula empírica C10H13N5O4. A adenosina é um pó branco cristalino, solúvel em\nágua e praticamente insolúvel em álcool. Sua solubilidade aumenta com o aquecimento e a\ndiminuição do pH. A solução injetável é incolor e deve estar livre de partículas visíveis.\n5.4 DOSAGENS\n5.4.1 DOSE MÁXIMA\nDose inicial máxima de 6 mg e doses subsequentes de até 12 mg a cada administração.\n5.4.2 TITULAÇAO DE DOSE E DESMAME\nNão se aplica.\n5.5 RECOMENDAÇÕES DE SEGURANÇA\nNão se aplica.\n6. FARMACOLOGIA CLINICAMENTE RELEVANTE\n2,3,5\n\n6.1 FARMACODINÂMICA\n6.1.1 MECANISMO DE AÇÃO\nA adenosina atua hiperpolarizando os tecidos atriais, reduzindo a duração do potencial de\nação atrial e reduzindo, ainda, a fase de despolarização diastólica das células do nó\nsinoatrial. Dessa forma, retardando a condução através do nó atrioventricular (AV) e inibindo\na atividade refratária através do nó AV de maneira a restaurar o ritmo sinusal normal em\npacientes com TPSV.\n6.1.2 INÍCIO DA AÇÃO\nMedicamento de ação imediata.\n6.2 FARMACOCINÉTICA\n6.2.1 ABSORÇÃO\n BIODISPONIBILIDADE\nBiodisponibilidade endovenosa: 100%\n PICO DE CONCENTRAÇÃO PLASMÁTICA\n\n\nFormulário Terapêutico Distrital\nO pico de concentração plasmática da adenosina é considerado extremamente rápido,\numa vez que o farmáco possui meia-vida de aproximadamente 10 s.\n\n6.2.2 DISTRIBUIÇÃO\n LIGAÇÃO A PROTEÍNAS PLASMÁTICAS\nNão se aplica\n SOLUBILIDADE\nNão se aplica\n6.2.3 METABOLISMO\nA adenosina é desaminada em inosina e fosforilada em monofosfato de adenosina (AMP)\npelas enzimas adenosinodesaminase e adenosinoquinase respectivamente. A inosina pode\npermanecer inalterada ou degradada em hipoxantina, xantina e, eventualmente, ácido úrico.\nO AMP é adicionado ao pool de fosfato de alta energia.\n6.2.4 ELIMINAÇÃO\n MEIA-VIDA DE ELIMINAÇÃO\nA adenosina é eliminada em até 10 s.\n7. INTERAÇÕES MEDICAMENTOSAS\n2,3,4,5\n\n7.1 INTERAÇÃO MEDICAMENTO X MEDICAMENTO\n Carbamazepina: a carbamazepina aumenta o grau de bloqueio cardíaco produzido pela\nadenosina. Quando utilizada para tratamento de taquiarritmias supraventriculares em adultos,\nrecomenda-se a redução da dose inicial da adenosina.\n Digoxina: o uso concomitante à adenosina ou à adenosina e verapamil pode ocasionar\nfibrilação ventricular devido ao potencial sinérgico dos efeitos depressores destes agentes\nsobre os nós AS e AV. Recomenda-se a monitorização durante a terapia simultânea com\nambos os medicamentos.\n Dipiridamol: os efeitos vasoativos da adenosina são potencializados pelo uso\nconcomitante ao dipiridamol, sendo necessária a redução das doses iniciais da adenosina.\n Metilxantinas: as metilxantinas como teofilina e aminofilina exercem antagonismo\nfarmacodinâmico à adenosina. O seu efeito terapêutico é reduzido, doses mais altas de\nadenosina podem ser necessárias.\n7.2 INTERAÇÃO MEDICAMENTO X ALIMENTO\nCafeína: assim como outras metilxantinas, bebidas contendo cafeína podem exercer\nantagonismo farmacodinâmico à adenosina, reduzindo seu efeito terapêutico. Doses mais\naltas de adenosina podem ser necessárias.\n7.3 INTERAÇÃO MEDICAMENTO X EXAMES LABORATORIAIS\nNão se aplica\n8. EFEITOS ADVERSOS\n2,3,5\n\n\n\nFormulário Terapêutico Distrital\n8.1 GRAVES\nEste medicamento pode causar assistolia prolongada, taquicardia e fibrilação ventricular,\nbradicardia, fibrilação atrial, bloqueio atrioventricular total, insuficiência cardíaca e infarto\nagudo do miocárdio. Além desses, também são relatados broncoespasmo e parada\nrespiratória.\n8.2 COMUNS\nEste medicamento pode causar rubor facial, dispneia, desconforto gastrointestinal, náuseas,\ncefaleia, parestesia e tontura. Além desses, também são relatados dor no peito, hipotensão\ne palpitações.\n9. AJUSTES DE DOSE\n2,3,4,5\n\n9.1. INJURIA RENAL\n9.1.1 ADULTO\nNão há necessidade de ajuste de dose em relação a função renal.\n9.1.2 CRIANÇA E NEONATO\nNão se aplica\n9.1.3 HEMODIÁLISE\nNão se aplica\n9.2. INSUFICIÊNCIA HEPATICA\n9.2.1 ADULTO\nNão há necessidade de ajuste de dose em relação a função hepática.\n9.2.2 CRIANÇA E NEONATO\nNão se aplica\n9.2.3 TRANSPLANTE CARDÍACO\nRecomenda-se a redução da dose inicial em pacientes submetidos a transplante de coração,\numa vez que no coração pós transplantado os nós sinusais e atrioventriculares apresentam-\nse mais sensíveis a adenosina.\n10. PRECAUÇÕES\n2,3,4,5\n\nRecomenda-se precaução durante o uso da adenosina em pacientes com histórico de\ndistúrbios convulsivos. A adenosina está associada ao desenvolvimento de crises tônico-\nclônicas. Em alguns casos, as convulsões foram prolongadas e exigiram tratamento\nanticonvulsivante de emergência.\nForam relatadas ainda situações de acidentes cerebrovasculares hemorrágicos e isquêmicos\nrelacionados a efeitos hemodinâmicos resultantes do uso da adenosina, como hipotensão ou\nhipertensão.\n10.1 CUIDADOS NA GRAVIDEZ\n\n\nFormulário Terapêutico Distrital\nNão foram realizados estudos em animais e nem em mulheres grávidas; ou então, os estudos\nem animais revelaram risco, mas não existem estudos disponíveis realizados em mulheres\ngrávidas.\n10.2 CUIDADOS NA AMAMENTAÇÃO\nNão há informações disponíveis a respeito da excreção da adenosina no leite humano. Caso\nnecessário o seu uso, os riscos de interrupção da amamentação após a administração da\nadenosina ou os riscos de exposição ao fármaco pelo lactente devem ser considerados.\n10.3 CUIDADOS NA CRIANÇA\nEm crianças e adolescentes que apresentem peso menor que 50kg, a dose máxima\nrecomendada é de 0,3mg/kg ou 12mg por dose, o que for menor.\n10.4 CUIDADOS NO IDOSO\nOs estudos clínicos realizados não incluíram número suficiente de pacientes com idade de\n65 anos ou mais, portanto, não foi possível a confirmação de uma resposta diferencial em\nrelação aos pacientes mais jovens. A adenosina deve ser utilizada com cautela em pacientes\nidosos, uma vez que essa população pode apresentar função cardíaca reduzida, disfunção\nnodal, doenças ou terapias concomitantes que podem alterar a função hemodinâmica e\nproduzir bradicardia severa ou bloqueio AV.\n11. CONSERVAÇÃO E ARMAZENAMENTO\n2,4\n\nEste medicamento deverá ser armazenado em temperatura ambiente (15 a 30°C), não deve\nser refrigerado pois há possibilidade de cristalização. E por não possuir conservante em sua\nformulação, se houver quantidade residual esta deve ser imediatamente descartada após a\nadministração.\n12. PRESCRIÇÃO\n\nE DISPENSAÇÃO\n1,6\n\n12.1 PRESCRIÇÃO\n12.1.1 RECEITUÁRIO\nPrescrição médica hospitalar, que deve ser realizada em sistema informatizado de gestão\nhospitalar ou prescrição manual de uso interno hospitalar, contendo as informações\nreferentes a identificação do paciente e a identificação do emitente (nome do profissional,\nnúmero do conselho regional ou instituição responsável, assinatura e carimbo).\n12.1.2 QUANTIDADE POR RECEITA\nNão se aplica\n12.1.3 LIMITE POR PRESCRIÇÃO\nNão se aplica\n12.1.4 VALIDADE\nNão se aplica\n12.2 DISPENSAÇÃO\n\n\nFormulário Terapêutico Distrital\nA dispensação dar-se-á restritamente nas farmácias das unidades hospitalares.\n13. ORIENTAÇÕES AO PACIENTE\n2,3,4\n\nNão se aplica\n14. ORIENTAÇÃO AO PROFISSIONAL DE SAÚDE\n3,4,5\n\n O medicamento deve ser administrado por via endovenosa direta e rápida (1 a 2\nsegundos), sem diluição.\n O medicamento deve ser administrado no sítio de injeção mais proximal ou no acesso\nvenoso central ou diretamente em um acesso periférico, recomenda-se seguir imediatamente\ncom a lavagem do acesso com SF 0,9%.\n Recomenda-se a monitoração de parâmetros para avaliação da conversão do ritmo sinusal\nou bloqueio atrioventricular através de eletrocardiograma.\n15. REFERÊNCIAS BIBLIOGRÁFICAS\n1.Secretaria de Estado de Saúde do Distrito Federal, Diretoria de Assistência Farmacêutica.\nCaderno técnico. Versão 6. Brasília: Secretaria de Estado de Saúde do Distrito Federal, 2020.\n2. Adenocard® [Bula] [Internet]. São Paulo: Libbs Farmacêutica Ltda;2013. [citado em 08 de\nnovembro de 2020] Disponível em:\nhttp://www.anvisa.gov.br/datavisa/fila_bula/frmVisualizarBula.asp\n3. Micromedex 2.0 [Internet]. Ann Arbor (MI): Truven Health Analytics Inc. 2018. Adenosina\n[cited 2020 Nov 08]. Available from: https://www.micromedexsolutions.com/home/dispatch\n4. Medscape [Internet]. New York (NY): Medscape LLC. 1994. Adenosine. [cited 2020 Nov\n08]. Available: https://reference.medscape.com/drug/adenocard-adenoscan-adenosine-\n342295.\n5. Neumar RW, Otto CW, Link MS, et al. Part 8: Adult Advanced Cardiovascular Life Support:\n2010 American Heart Association Guidelines for Cardiopulmonary Resuscitation and\nEmergency Cardiovascular Care. 2010\n6. Secretaria de Estado de Saúde do Distrito Federal. Relação de Medicamentos\nPadronizados - REME/DF - versão para profissionais de saúde [Internet]. Brasília: [citado em\n04 jan. 2021\n\n\nNome Cargo Data\nElaboração « Raiane Diniz Oliveira» «Farmacêutico» «07/12/2020»\nRevisão « Antonio Marco Santana Souza» « Farmacêutico » «03/02/2021»\nAprovação «Walleska Fidelis Gomes Borges»\n«Diretora de Assistência\nFarmacêutica»\n«13/05/2021»\nAtualização «atualizadores» «cargoatualizador» «dt_criacao»",
      "pageCount": 6,
      "errorMessage": null,
      "createdAt": "2025-12-10T11:40:30.206Z",
      "updatedAt": "2025-12-10T11:40:30.476Z"
    },
    {
      "id": "76553d70-ec82-4677-9fb0-d2ef7d383e5f",
      "userId": "f699d9ec-c69f-4894-8616-146959a7a518",
      "originalName": "Claude-Estrutura do projeto e implementaÃ§Ã£o local.pdf",
      "storedName": "61a7bc25-a065-4617-b23d-3e32f147af6e.pdf",
      "filePath": "uploads\\f699d9ec-c69f-4894-8616-146959a7a518\\61a7bc25-a065-4617-b23d-3e32f147af6e.pdf",
      "fileSize": 272441,
      "mimeType": "application/pdf",
      "status": "processed",
      "extractedText": "Estrutura do projeto e implementação local\nleia o arquivo tree.md para entender a estrutura do projeto, ha 2 index.js\nsendo um do front e outro do back. verifica o progresso do projeto com base\nnos arquivos atuais e vamos implementar a parte que falta. detalhe\nimportante da implementaçao é fazer com que seja possivel testar\nlocalmente\n12/9/2025, 6:27:36 PM\nThought process: Mapeou progresso do projeto SGM e identificou\nfuncionalidades faltantes.\nO usuário quer que eu analise o progresso do projeto SGM (Sistema\nde Gerenciamento Multimídia) com base nos arquivos fornecidos e\nna especificação de requisitos. Vou verificar o que já está\nimplementado e o que falta.\nDeixe-me analisar os arquivos:\n1. **Backend (index.js)** - Servidor Express com:\n- Autenticação JWT ✅\n- Rotas de login/register ✅\n- Rotas de perfil (GET, PUT, upload foto) ✅\n- Rotas de mídia (via mediaRoutes) ✅\n- Conexão com PostgreSQL ✅\n2. **Models**:\n- User.js ✅ (completo com hash de senha, validações)\n- Media.js ✅ (com campos para thumbnail, tipo, etc.)\n3. **Controllers**:\n- mediaController.js ✅ (upload, list, get, update, delete)\n Powered by Claude Exporter\n1 / 18\n\n4. **Config**:\n- database.js ✅ (PostgreSQL/RDS)\n- s3.js ✅ (cliente S3)\n- upload.js ✅ (multer-s3 para foto de perfil)\n- mediaUpload.js ✅ (multer-s3 para mídias)\n5. **Utils**:\n- thumbnailGenerator.js ✅ (gera thumbnails para imagens e\nvídeos)\n6. **Frontend**:\n- index.html ✅ (páginas de login, signup, profile, dashboard)\n- index.css ✅ (estilos completos)\n- index.js ✅ (lógica de autenticação, upload, listagem,\nfiltros, paginação)\n**O que está implementado:**\nTodos os requisitos funcionais principais já foram desenvolvidos,\nincluindo registro de usuários, autenticação segura,\ngerenciamento de perfil e funcionalidades completas de upload e\nvisualização de mídias. O sistema garante armazenamento seguro no\nS3 e possui geração de thumbnails para diferentes tipos de mídia.\nRestam duas implementações críticas pendentes: gerenciamento de\ntags para mídias e definição de metadados específicos por tipo de\nconteúdo. Essas melhorias permitirão uma classificação mais\nprecisa e uma experiência de busca mais refinada, agregando valor\nsignificativo à plataforma de gerenciamento de conteúdo.\nPara imagens, áudio e vídeo, preciso extrair metadados técnicos\ndetalhados como dimensões, duração, resolução e características\nespecíficas de cada mídia. Isso possibilitará uma análise mais\nprofunda e organizada dos arquivos.\n Powered by Claude Exporter\n2 / 18\n\nO próximo passo envolve implementar processamento de vídeo em\nmúltiplas qualidades, criando variações em 1080p, 720p e 480p,\nalém de desenvolver uma interface que permita seleção dinâmica de\nresolução durante reprodução.\nComplementarmente, desenvolverei visualizações completas para\ncada tipo de mídia, incluindo modal para imagens em tamanho real,\nplayers dedicados para áudio e vídeo, com recursos avançados de\nreprodução e seleção de qualidade.\nA pesquisa atual limitada por nome de arquivo será expandida para\nincluir descrições e tags, ampliando significativamente as\npossibilidades de busca.\nVerificarei os arquivos do projeto para confirmar os detalhes da\nimplementação do campo de gênero.\nVou analisar o progresso do projeto com base nos arquivos fornecidos e na\nespecificação de requisitos.\nView: Ver estrutura atual do projeto\nThought process: Mapeou implementações existentes versus\nfuncionalidades pendentes do projeto.\nAgora vou analisar detalhadamente os arquivos para mapear o que\nestá implementado vs o que falta. Deixe-me verificar\nespecialmente o modelo Media e o controller para ver quais campos\ne funcionalidades existem.\nAgora deixe-me analisar detalhadamente o que está implementado versus o que\nfalta conforme a especificação:\n Powered by Claude Exporter\n3 / 18\n\n Análise de Progresso do Projeto SGM\n✅ IMPLEMENTADO\nRequisitoStatusDetalhes\nRF-1.1✅Registro de usuários\nRF-1.2✅Autenticação JWT\nRF-1.3✅Gerenciamento de perfil\nRF-2.1✅Upload de imagens, áudio e vídeo para S3\nRF-2.2✅Armazenamento seguro no S3\nRF-2.3✅Listagem de mídias\nRF-2.5✅Exclusão (soft/hard delete)\nRF-2.6✅Thumbnail de imagens\nRF-2.8✅Thumbnail de vídeos (1º frame)\nRF-4.1/4.2/4.3✅Listagem com filtros por tipo e paginação\n❌ FALTA IMPLEMENTAR\nRequisitoDescriçãoPrioridade\nRF-2.4Tags para categorização de mídiasAlta\nRF-2.7Extração de metadados de imagens (dimensões, Exif)Média\nRF-\n2.10/2.11\nProcessamento de vídeo em múltiplas qualidades (1080p,\n720p, 480p)\nAlta\nRF-3.1Pesquisa por descrição e tags (só filename funciona)Alta\nRF-5.2Visualização/Player completo (modal de imagem, player de\náudio/vídeo)\nAlta\n-Extração de metadados de áudio (duração, bitrate, canais)Média\n Powered by Claude Exporter\n4 / 18\n\nRequisitoDescriçãoPrioridade\n-Extração de metadados de vídeo (duração, resolução,\nframerate)\nMédia\n-Campo gênero para áudio/vídeoBaixa\nVou implementar as funcionalidades que faltam. Começarei pelas de maior\nprioridade:\n1. Tags no modelo e API\n2. Pesquisa por descrição e tags\n3. Metadados para cada tipo de mídia\n4. Modal de visualização/player no frontend\n5. Processamento de vídeo em múltiplas qualidades\nVou criar os arquivos necessários:\nEdit: Adicionar campo tags e metadata ao modelo Media\nThought process\nDeixe-me verificar o conteúdo exato do arquivo Media.js\nView: Ver conteúdo atual do modelo Media\nThought process: Identificou estrutura do projeto e planejou\nexpandir modelo Media.\nAgora eu vejo o arquivo. O encoding UTF-8 está causando\ncaracteres estranhos, mas o importante é que posso ver a\n Powered by Claude Exporter\n5 / 18\n\nestrutura. Vou atualizar o modelo Media para adicionar tags,\nmetadata, genre e video_versions.\nEdit: Adicionar novos campos ao modelo Media (tags, genre,\nmetadata, video_versions)\nThought process: Identificou problema técnico e reorganizou\narquivos para prosseguir.\nParece que há um problema de encoding. Vou copiar o arquivo para\no meu espaço de trabalho e recriá-lo com as alterações\nnecessárias.\nVou copiar e recriar o arquivo Media.js com os novos campos:\nBash Tool: Copiar arquivo Media.js para edição\nThought process: Mapeou estrutura do projeto e planejou\nimplementação testável.\nVou criar uma nova versão do arquivo Media.js com todas as\nalterações necessárias.\nCreate File: Criar modelo Media atualizado com tags, metadata,\ngenre e video_versions\nThought process: Planejou criar utilitário separado para extração\nde metadados.\nAgora vou criar o utilitário de extração de metadados. Vou criar\num arquivo separado para isso.\n Powered by Claude Exporter\n6 / 18\n\nAgora vou criar o utilitário de extração de metadados:\nCreate File: Criar utilitário de extração de metadados para\nimagens, áudio e vídeo\nThought process: Arquitetou processador assíncrono de vídeo\nmultiqualidade.\nAgora vou criar o processador de vídeo para múltiplas qualidades\n(RF-2.10, RF-2.11). Este é um processo assíncrono que roda em\nbackground após o upload.\nAgora vou criar o processador de vídeo para múltiplas qualidades:\nCreate File: Criar processador de vídeo para múltiplas qualidades\n(RF-2.10, RF-2.11)\nThought process: Mapeou funcionalidades faltantes do\nmediaController para implementação local.\nAgora vou atualizar o mediaController para incluir:\n1. Extração de metadados no upload\n2. Processamento de vídeo em background\n3. Pesquisa por descrição e tags (RF-3.1)\n4. Atualização de tags\nAgora vou criar o controller atualizado com todas as novas funcionalidades:\nCreate File: Criar mediaController atualizado com metadados, tags\ne processamento de vídeo\nThought process: Arquitetou rotas atualizadas para integrar novas\nfuncionalidades.\n Powered by Claude Exporter\n7 / 18\n\nAgora vou criar as rotas atualizadas para incluir as novas\nfuncionalidades.\nCreate File: Criar rotas de mídia atualizadas com novas\nfuncionalidades\nThought process: Planejou implementar modal de visualização para\nmídia faltante.\nAgora vou criar o frontend atualizado com o modal de\nvisualização/player para imagens, áudio e vídeo. Isso é a parte\nmais importante que falta (RF-5.2).\nAgora vou criar o frontend atualizado com o modal de visualização/player:\nView: Ver estrutura atual do index.html do frontend\nThought process: Mapeou estrutura HTML para integrar modal de\nvisualização.\nVou ver o resto do arquivo HTML para entender melhor a estrutura\ne onde adicionar o modal de visualização.\nView: Ver resto do index.html\nThought process: Planejou implementar funcionalidades faltantes\ncom testes locais.\nAgora vou criar um arquivo HTML atualizado com:\n1. Modal de visualização de mídia (para imagens, áudio e vídeo) -\nRF-5.2\n2. Campo de tags no upload - RF-2.4\n Powered by Claude Exporter\n8 / 18\n\n3. Campo de gênero para áudio/vídeo\n4. Seletor de qualidade de vídeo - RF-2.11\nTambém vou criar o JavaScript atualizado com todas as novas\nfuncionalidades.\nVou criar o HTML atualizado com o modal de visualização:\nCreate File: Criar HTML atualizado com modal de visualização e\ncampos de tags\nThought process: Preparou-se para estilizar componentes modais\nadicionais.\nAgora vou criar o CSS adicional para os novos componentes do\nmodal de visualização.\nAgora vou criar o CSS adicional para os novos componentes:\nCreate File: Criar CSS adicional para modal de visualização de\nmídia\nThought process: Planejou implementar funcionalidades de\nvisualização, tags e player de vídeo.\nAgora vou criar o JavaScript atualizado com todas as novas\nfuncionalidades de visualização, tags, metadados e player de\nvídeo com seleção de qualidade.\nAgora vou criar o JavaScript atualizado com todas as funcionalidades:\nCreate File: Criar JavaScript atualizado com visualização de\n Powered by Claude Exporter\n9 / 18\n\nmídia, tags e player de vídeo\n12/9/2025, 6:40:40 PM\n Powered by Claude Exporter\n10 / 18\n\ncontinua\n12/9/2025, 6:37:16 PM\nThought process: Orchestrated database configuration and file\norganization strategy.\nO usuário quer que eu continue com a implementação. Vou continuar\ncriando os arquivos necessários e depois copiar tudo para o\ndiretório de saída para que o usuário possa baixar.\nPreciso:\n1. Criar o arquivo de configuração de banco de dados para\nsuportar testes locais (SQLite) e produção (PostgreSQL)\n2. Atualizar o initDB.js\n3. Criar um arquivo de instruções para teste local\n4. Copiar todos os arquivos para o diretório de saída\nVou continuar criando os arquivos restantes, incluindo suporte para testes locais\ncom SQLite:\nCreate File: Criar configuração de banco de dados com suporte a\nSQLite (local) e PostgreSQL (produção)\nThought process: Architected updated S3 module with local\ndevelopment support.\nAgora vou criar o s3.js atualizado com suporte para modo local\n(mock S3 ou MinIO).\nCreate File: Criar configuração S3 com suporte para modo local\n(armazenamento em disco)\n Powered by Claude Exporter\n11 / 18\n\nThought process: Prepared updated upload.js with local mode\nsupport.\nAgora vou criar o upload.js atualizado com suporte para modo\nlocal.\nCreate File: Criar configuração de upload com suporte local e S3\nThought process: Prepared updated file with local support\nintegration.\nAgora vou criar o mediaUpload.js atualizado com suporte local.\nCreate File: Criar configuração de upload de mídia com suporte\nlocal e S3\nThought process: Preparou atualização completa do backend com\nrotas.\nAgora vou criar o index.js do backend atualizado com todas as\nrotas e suporte local.\nCreate File: Criar index.js do backend atualizado com suporte\nlocal e novas rotas\n12/9/2025, 6:50:52 PM\n Powered by Claude Exporter\n12 / 18\n\ncontinua\n12/9/2025, 6:45:45 PM\nThought process: Orchestrated creation of seven project\ninfrastructure files.\nO usuário quer que eu continue criando os arquivos necessários\npara o projeto. Vou continuar com:\n1. Script de inicialização do banco de dados atualizado\n2. Gerador de thumbnails atualizado para modo local\n3. Extrator de metadados atualizado\n4. Processador de vídeo atualizado\n5. Controller de mídia atualizado para modo local\n6. Arquivo .env.example atualizado\n7. Script de setup/instalação\nCreate File: Criar script de inicialização do banco de dados\natualizado\nThought process: Deliberated file management strategy and content\nreview approach.\nO arquivo já existe, vou criar com outro nome ou sobrescrever via\nstr_replace. Vou usar view para ver o conteúdo e depois criar o\npróximo arquivo.\nCreate File: Criar gerador de thumbnails atualizado com suporte\nlocal\nThought process\n Powered by Claude Exporter\n13 / 18\n\nOs arquivos já existem. Vou verificar quais arquivos existem e\ncriar os que faltam ou usar nomes diferentes.\nView: Ver arquivos criados no diretório /home/claude\nThought process: Inventoried existing files and planned\ncomprehensive setup documentation.\nJá tenho muitos arquivos criados. Vou verificar o que ainda falta\ne criar um script de instalação completo que organize tudo.\nTambém preciso criar o package.json atualizado e um README de\ninstruções.\nVou criar os arquivos finais necessários e um script de setup completo:\nEdit: Atualizar package.json com todas as dependências\nnecessárias\nThought process: Deliberated file management and overwrite\nstrategy.\nO arquivo tem conteúdo diferente. Vou criar um novo arquivo com\nnome diferente ou sobrescrever.\nView: Ver conteúdo do package_updated.json\nThought process: Planejou criar script de setup e documentação\ndetalhada.\nO package.json já está configurado corretamente. Agora vou criar\num script de instalação/setup completo e um README com instruções\ndetalhadas.\n Powered by Claude Exporter\n14 / 18\n\nVou criar um README detalhado e um script de setup automático:\nCreate File: Criar README com instruções completas de instalação\ne uso\nThought process: Ideou automatizar cópia de arquivos para\nprojeto.\nAgora vou criar um script de setup que automatiza a cópia de\ntodos os arquivos para o projeto.\nEdit: Atualizar script de setup para copiar todos os arquivos\nThought process\nVou ver o conteúdo atual do setup.sh e recriá-lo.\nView: Ver conteúdo atual do setup.sh\nThought process\nO script de setup já está bom. Agora vou criar um script separado\nque aplica as atualizações do projeto - copia os arquivos\natualizados para os locais corretos.\nView: Ver o script apply_updates.sh existente\nThought process: Executará script e verificará aplicação das\natualizações.\nO script apply_updates.sh já está bem completo. Agora vou\nexecutar este script para aplicar todas as atualizações ao\n Powered by Claude Exporter\n15 / 18\n\nprojeto, e depois vou verificar se tudo foi aplicado\ncorretamente.\nVou aplicar as atualizações ao projeto:\nBash Tool: Aplicar todas as atualizações ao projeto\nThought process: Investigou estrutura do projeto frontend.\nO frontend está em uma estrutura diferente. Vou verificar a\nestrutura real do projeto.\nPreciso verificar a estrutura real do projeto:\nView: Ver estrutura do projeto\nThought process: Reassessed project structure and devised\ncorrected file-copying script.\nInteressante! A estrutura do projeto é diferente do que esperava.\nOs arquivos do frontend (index.html, index.css, index.js) estão\nna raiz do projeto, não em uma pasta FrontEnd/. Vou criar um\nscript corrigido para copiar os arquivos para os locais corretos.\nVou copiar os arquivos do frontend para os locais corretos:\nBash Tool: Copiar arquivos frontend para a raiz do projeto\nThought process: Verificou arquivos copiados e ajustes backend\nnecessários.\nAgora os arquivos do frontend foram copiados. Vou também\n Powered by Claude Exporter\n16 / 18\n\nverificar se o Backend precisa de algum ajuste para servir os\narquivos do frontend da raiz do projeto (não de ../FrontEnd/).\nAgora preciso ajustar o index.js do backend para servir o frontend da raiz:\nView: Ver index.js do backend atualizado\nThought process: Identified frontend path requiring recalibration\nto project root.\nPreciso alterar o caminho do frontend de '../FrontEnd' para '..'\n(raiz do projeto) já que os arquivos do frontend estão na raiz.\nEdit: Ajustar caminho do frontend para a raiz do projeto\nThought process: Preparou ambiente e iniciou testes operacionais.\nAgora vou instalar as dependências e iniciar o servidor para\ntestar.\nAgora vou instalar as dependências e inicializar o banco:\nBash Tool: Instalar SQLite3 para modo local\nThought process: Avaliou necessidade de configurar arquivo\nambiental.\nVou verificar se precisa criar o arquivo .env antes de\ninicializar o banco de dados.\nBash Tool: Criar arquivo .env se não existir\n Powered by Claude Exporter\n17 / 18\n\nThought process\nAgora vou verificar o conteúdo do .env existente para garantir\nque está correto.\nView: Ver conteúdo do .env\nThought process: Verified configuration and prepared database\ninitialization.\nPerfeito, o arquivo .env está correto. Agora vou inicializar o\nbanco de dados.\nBash Tool: Inicializar banco de dados SQLite\n12/9/2025, 6:54:54 PM\n Powered by Claude Exporter\n18 / 18",
      "pageCount": 18,
      "errorMessage": null,
      "createdAt": "2025-12-10T11:55:55.592Z",
      "updatedAt": "2025-12-10T11:55:55.841Z"
    }
  ],
  "summaries": [
    {
      "id": "e27a406e-fea1-4b36-8ebb-a1ce810671a7",
      "userId": "a76885c4-9792-401d-b69f-42ed35c5d123",
      "title": "Summary of Adenosina.pdf",
      "content": "O Formulário Terapêutico Distrital apresenta informações sobre a adenosina, um medicamento utilizado no tratamento da taquicardia paroxística supraventricular. É contraindicado em casos de bloqueio atrioventricular de segundo e terceiro graus, doença do nó sinusal, hipersensibilidade à adenosina, e doença pulmonar obstrutiva. Deve ser administrado via endovenosa direta, com dose inicial de 6 mg em 1 a 2 segundos, podendo ser repetido com intervalo de 1 a 2 minutos. Possui interações medicamentosas com carbamazepina, digoxina, dipiridamol e metilxantinas. Pode causar efeitos adversos graves como assistolia prolongada e taquicardia, além de efeitos comuns como rubor facial e náuseas. Recomenda-se precaução em pacientes com distúrbios convulsivos e em idosos. Deve ser armazenado em temperatura ambiente e não refrigerado. A prescrição e dispensação devem ser realizadas em ambiente hospitalar. Recomenda-se monitoração dos parâmetros cardíacos durante a administração.",
      "type": "single",
      "documentIds": "[\"c2b454d3-a1ab-4ffa-bd54-f891b2a2c802\"]",
      "model": "gpt-3.5-turbo",
      "tokensUsed": 3019,
      "processingTime": 4644,
      "method": "stuff",
      "createdAt": "2025-12-08T03:25:44.097Z",
      "updatedAt": "2025-12-08T03:25:44.097Z"
    },
    {
      "id": "4c5766ac-3774-4566-9847-ce24774f585d",
      "userId": "a76885c4-9792-401d-b69f-42ed35c5d123",
      "title": "Summary of Adenosina.pdf",
      "content": "Resumo abrangente do Formulário Terapêutico Distrital – Adenosina (Raiane Diniz Oliveira)\n\nIdentificação\n- Produto: Adenosina solução inj. 3 mg/mL, ampola 2 mL (uso hospitalar)\n- Coordenação: Governo do Distrito Federal, Secretaria de Estado de Saúde\n- Finalidade: Tratamento de taquicardia paroxística supraventricular (TPSV) ao ritmo sinusal, incluindo TPSV associada à síndrome de Wolff-Parkinson-White, visando reversão ao ritmo sinusal\n- Autores/revisores: Elaboração Raiane Diniz Oliveira; Revisão Antonio Marco Santana Souza; Aprovação Wallsleka Fidelis Gomes Borges\n\n1)Apresentações padronizadas e acesso\n- Apresentação padronizada: Adenosina 3 mg/mL, ampola 2 mL\n- Acesso: uso hospitalar (estoque hospitalar/dispensa restrita a farmácias de unidades hospitalares)\n\n2)Classe terapêutica\n- Outros preparados cardíacos\n\n3)Indicações\n- TPSV com reversão para ritmo sinusal, incluindo TPSV com Wolff-Parkinson-White\n\n4)Contraindicações\n- Bloqueio AV de 2º ou 3º grau (exceto se houver marcapasso funcional)\n- Doença do nó sinusal ou bradicardia sintomática (exceto se houver marcapasso funcional)\n- Hipersensibilidade à adenosina ou componentes da fórmula\n- Doença pulmonar obstrutiva conhecida ou suspeita (ex.: asma)\n\n5)Administração e uso\n- Via: endovenosa (EV)\n- Modo de uso: bolus EV direto, dose inicial de 6 mg em 1–2 segundos; repetir 1–2 aplicações subsequentes com intervalos de 1–2 minutos; doses únicas superiores a 12 mg não são recomendadas\n- Observação de uso: administrar sem diluição; qualquer volume não utilizado deve ser descartado imediatamente (fórmula sem conservantes)\n- Compatibilidade: compatível com SG 5%, SRL e SF 0,9%\n- Formulação: adenosina é nucleosídeo endógeno; solução injetável incolor, livre de partículas\n\n5.3 Características da formulação\n- Propriedades físico-químicas: pó branco cristalino, solúvel em água; insolúvel em álcool; solubilidade aumenta com aquecimento e diminui com menor pH\n\n5.4 Dosagens\n- Dose inicial máxima: 6 mg\n- Doses subsequentes: até 12 mg por administração\n- Titulação/desmame: não se aplica\n\n5.5 Recomendações de segurança\n- Não há instruções adicionais\n\n6) Farmacologia clinicamente relevante\n- Farmacodinâmica: hiperpolariza tecidos atriais, reduz duração do potencial de ação atrial, reduz despolarização diastólica do nó sinoatrial; retarda condução através do nó AV e aumenta a refratariedade do AV, favorecendo restauração do ritmo sinusal\n- Início de ação: imediato\n- Farmacocinética:\n  - Absorção: biodisponibilidade IV = 100%\n  - Distribuição: não aplicável\n  - Metabolismo: desaminação para inosina e AMP; inosina pode seguir diferentes vias; AMP entra no pool de fosfatos de alta energia\n  - Eliminação: meia-vida de ~10 segundos\n\n7)Interações medicamentosas\n- Medicamento x medicamento:\n  - Carbamazepina: aumenta bloqueio cardíaco; reduzir dose inicial da adenosina\n  - Digoxina (com verapamil): possível fibrilação ventricular; monitorização recomendada\n  - Dipiridamol: potencia efeitos vasodilatadores da adenosina; reduzir dose inicial\n  - Metilxantinas (teofilina, aminofilina): antagonizam adenosina; possíveis necessidade de dose maior\n- Medicamento x alimento:\n  - Cafeína (metilxantina): antagoniza farmacodinâmico; doses maiores de adenosina podem ser necessárias\n- Medicamento x exames laboratoriais: não aplicável\n\n8)Efeitos adversos\n- Graves: assistolia prolongada, taquicardia, fibrilação ventricular, bradicardia, bloqueio AV total, insuficiência cardíaca, infarto; broncoespasmo e parada respiratória relatados\n- Comuns: rubor facial, dispneia, desconforto GI, náuseas, cefaleia, parestesia, tontura; dor no peito, hipotensão, palpitações também relatados\n\n9)Ajustes de dose\n- Insuficiência renal:\n  - Adulto: sem ajuste necessário\n  - Criança/neonata: não aplicável\n  - Hemodiálise: não aplicável\n- Insuficiência hepática:\n  - Adulto: sem ajuste necessário\n  - Criança/neonato: não aplicável\n- Transplante cardíaco: reduzir dose inicial, pois nós sinusais e AV podem ser mais sensíveis\n\n10)Precauções\n- Cautela em histórico de convulsões; associa-se a crises tônico-clônicas; casos graves de convulsões podem exigir anticonvulsivante de emergência\n- Riscos de acidente cerebrovascular hemorrágico ou isquêmico relacionado a hipotensão/hipertensão induzidos pela adenosina\n- Gravidez: estudos em animais/grávidos não disponíveis ou indicam risco sem dados suficientes\n- Amamentação: ausência de informações sobre excreção no leite; considerar riscos/benefícios\n- Criança: peso < 50 kg, dose máxima recomendada 0,3 mg/kg ou 12 mg por dose (o que for menor)\n- Idoso: menos dados; usar com cautela devido à possível função cardíaca reduzida e maior sensibilidade a efeitos hemodinâmicos\n\n11)Conservação e armazenamento\n- Armazenar em temperatura ambiente (15–30°C)\n- Não refrigerar (risco de cristalização)\n- Não possuir conservante; descarte imediato de qualquer volume residual\n\n12)Prescrição e dispensação\n- Prescrição: hospitalar, em sistema informatizado ou prescrição manual hospitalar; incluir identificação do paciente e do profissional (nome, conselho, assinatura/carteira)\n- Quantidade por receita: não especificada\n- Limite por prescrição: não aplicável\n- Validade: não especificada\n- Dispensação: restrita às farmácias das unidades hospitalares\n\n13)Orienta­ções ao paciente\n- Não aplicável de forma específica no documento\n\n14)Orienta­ção ao profissional de saúde\n- Administração EV direta rápida (1–2 segundos), sem diluição\n- Iniciar no sítio de injeção mais proximal, ou acesso venoso central/periférico; lavar imediatamente com SF 0,9%\n- Monitorização com ECG para avaliar conversão ao ritmo sinusal ou bloqueio AV\n\n15)Referências\n- Fontes oficiais do DF, bulas e diretrizes de cardiologia/arritmias e farmacêuticas\n- Citações de materiais de referência (REME/DF, bulas de Adenocard/Adenoscan, Micromedex, Medscape, diretrizes AHA)\n\nObservações finais\n- O formulário oferece orientação prática para uso hospitalar da adenosina, incluindo dose inicial, limites por dose, monitorização, interações relevantes, precauções especiais (principalmente em transplante cardíaco, idosos e pacientes com histórico convulsivo) e requisitos de armazenamento e prescrição. Mantém a estrutura lógica do conteúdo original, com foco em segurança, eficácia e uso adequado no contexto hospitalar.",
      "type": "single",
      "documentIds": "[\"7b4fb0e4-1a7a-4862-8c00-01af53e2d9be\"]",
      "model": "gpt-5-nano",
      "tokensUsed": 4348,
      "processingTime": 36971,
      "method": "stuff",
      "createdAt": "2025-12-08T03:29:35.962Z",
      "updatedAt": "2025-12-08T03:29:35.962Z"
    },
    {
      "id": "0f6d741d-c6b3-4ccb-9172-90cbba63a47b",
      "userId": "a76885c4-9792-401d-b69f-42ed35c5d123",
      "title": "Summary of Adenosina.pdf",
      "content": "O documento apresenta o Formulário Terapêutico Distrital para a adenosina, um medicamento utilizado no tratamento da taquicardia paroxística supraventricular (TPSV), incluindo casos associados à síndrome de Wolff-Parkinson-White, com o objetivo de restaurar o ritmo sinusal. A adenosina é disponibilizada na apresentação de solução injetável de 3 mg/ml em ampola de 2 ml, destinada ao uso hospitalar, e classificada como um preparado de classe terapêutica de outros preparados cardíacos.\n\nSeu uso é contraindicado em pacientes com bloqueio atrioventricular de segundo e terceiro graus (exceto com marcapasso), doença do nó sinoatrial, bradicardia sintomática (com ou sem marcapasso), além de hipersensibilidade à droga e doenças pulmonares obstrutivas, como asma. A administração é endovenosa, com dose inicial de 6 mg administrada rapidamente (1 a 2 segundos), podendo ser repetida com intervalos de 1 a 2 minutos, até o máximo de 12 mg por dose.\n\nA farmacologia da adenosina indica ação imediata, com rápida eliminação (meia-vida de aproximadamente 10 segundos). Seu mecanismo de ação envolve hiperpolarização atrial, redução do potencial de ação e condução pelo nó atrioventricular, promovendo a reversão ao ritmo sinusal. A droga é metabolizada por desaminação em inosina e fosforilação em AMP, sendo eliminada rapidamente.\n\nEntre as interações medicamentosas, destacam-se o aumento do efeito de bloqueio cardíaco com carbamazepina, risco de fibrilação ventricular com digoxina e verapamil, potencialização dos efeitos vasodilatadores com dipiridamol, e antagonismo com metilxantinas como cafeína e teofilina, que podem reduzir sua eficácia. Efeitos adversos graves incluem assistolia prolongada, fibrilação ventricular, bloqueios cardíacos, insuficiência cardíaca, além de broncoespasmo e parada respiratória. Efeitos comuns incluem rubor facial, dispneia, desconforto gastrointestinal, cefaleia, tontura e palpitações.\n\nA dose máxima recomendada é de 6 mg na dose inicial, podendo chegar a 12 mg em doses subsequentes. Não há necessidade de ajuste em insuficiência renal ou hepática, mas em transplantes cardíacos recomenda-se redução da dose inicial devido à maior sensibilidade do nó sinoatrial. Precauções incluem atenção em pacientes com histórico de convulsões, risco de crises prolongadas, acidentes cerebrovasculares, além de cautela em idosos devido à possível disfunção cardíaca.\n\nO armazenamento deve ser feito em temperatura ambiente (15-30°C), sem refrigeração, e o medicamento deve ser descartado imediatamente após uso, por não conter conservantes. A prescrição é restrita a receita médica hospitalar, com dispensação exclusiva em unidades hospitalares. Orientações ao profissional de saúde incluem administração rápida, monitoramento eletrocardiográfico e cuidados na via de administração. O documento também fornece referências técnicas e recomendações para uso seguro e eficaz da adenosina.",
      "type": "single",
      "documentIds": "[\"7b4fb0e4-1a7a-4862-8c00-01af53e2d9be\"]",
      "model": "gpt-4.1-nano",
      "tokensUsed": 3504,
      "processingTime": 5942,
      "method": "stuff",
      "createdAt": "2025-12-08T03:35:25.442Z",
      "updatedAt": "2025-12-08T03:35:25.442Z"
    },
    {
      "id": "befe58ff-5551-491e-b6a4-b37703f514b2",
      "userId": "a76885c4-9792-401d-b69f-42ed35c5d123",
      "title": "Summary of 972-Edital-de-Abertura-POSCOMP-2025_3.pdf",
      "content": "POSCOMP 2025 is a Brazilian online exam organized by SBC and FUNDATEC to select candidates for postgraduate Computing programs. It features a 70-question multiple-choice test covering mathematics, computing fundamentals, and technology, scheduled for August 31, 2025. Registration, open from May 22 to July 8, requires online forms, fee payment, and adherence to strict deadlines. Candidates must submit accurate data, digital photos, and, if eligible, fee exemption requests with supporting documents. The exam mandates a secure environment, with remote proctoring via video, audio, facial recognition, and AI monitoring. Special accommodations are available for candidates with disabilities, requiring medical proof. Results will be published on the official website, with appeals permitted within specified periods. The process emphasizes compliance with rules, data privacy, and integrity, with penalties for misconduct or irregularities.",
      "type": "single",
      "documentIds": "[\"cdd04bfb-9b37-48a9-8114-a1689e416f32\"]",
      "model": "gpt-4.1-nano",
      "tokensUsed": 21476,
      "processingTime": 7563,
      "method": "map_reduce",
      "createdAt": "2025-12-08T03:36:24.999Z",
      "updatedAt": "2025-12-08T03:36:24.999Z"
    },
    {
      "id": "49ab6d9d-23f4-430d-89cc-f6078eeb0f53",
      "userId": "a76885c4-9792-401d-b69f-42ed35c5d123",
      "title": "Integrated Summary (2 documents)",
      "content": "Resumo Integrado Final:\n\nEste documento combina informações de dois temas distintos: o processo de seleção para o exame POSCOMP 2025 no Brasil e o uso clínico da Adenosina no tratamento de taquicardia paroxística supraventricular (TPSV).\n\nO POSCOMP 2025 é uma avaliação nacional online destinada a candidatos a pós-graduação em Computação, coordenada pela SBC e administrada pela FUNDATEC. O exame, agendado para 31 de agosto de 2025, consiste em uma prova de 70 questões de múltipla escolha, abordando matemática, ciência da computação e tópicos relacionados. O processo de inscrição exige atenção rigorosa às datas, precisão nos dados fornecidos e pagamento via boleto, com possibilidades de isenção para candidatos de baixa renda. A realização do exame é totalmente online, com medidas de segurança e monitoramento para garantir a integridade do processo. Os resultados serão divulgados em outubro, com possibilidade de recursos, e o edital detalha regras de conduta, requisitos de documentação, e procedimentos administrativos, enfatizando a importância da ética, da transparência e do cumprimento de prazos.\n\nPor outro lado, o documento sobre Adenosina apresenta o formulário terapêutico para o uso do medicamento no tratamento de TPSV, incluindo casos associados à síndrome de Wolff-Parkinson-White. A Adenosina é administrada por via endovenosa em doses específicas, com início de ação imediato devido à sua rápida metabolização, e atua hiperpolarizando tecidos atriais, retardando a condução pelo nó atrioventricular, promovendo a restauração do ritmo sinusal normal. Sua apresentação padrão é uma solução injetável de 3 mg/ml, em ampola de 2 ml, destinada ao uso hospitalar sob monitoramento contínuo. O uso do medicamento requer atenção a contraindicações, como bloqueios AV de segundo e terceiro graus (exceto com marcapasso), doenças do nó sinoatrial, hipersensibilidade, e doenças pulmonares obstrutivas. Efeitos adversos podem variar de leves, como rubor facial e desconforto gastrointestinal, a graves, incluindo assistolia prolongada, fibrilação ventricular, e broncoespasmo, exigindo monitoramento rigoroso durante a administração. O armazenamento deve ser em temperatura ambiente, sem refrigeração, e o medicamento deve ser descartado após uso, devido à ausência de conservantes. A prescrição é restrita a receita médica hospitalar, reforçando a necessidade de cuidados profissionais na administração.\n\nTemas em comum incluem a ênfase na importância do cumprimento de procedimentos, seja na realização de exames nacionais ou na administração de medicamentos, ambos requerendo atenção a regras, segurança e ética. Ambos os documentos destacam a necessidade de monitoramento e cuidados específicos para garantir resultados eficazes e seguros, seja na avaliação acadêmica ou no tratamento clínico.\n\nDiferenças relevantes residem na natureza dos temas: enquanto o POSCOMP trata de um processo seletivo de caráter acadêmico e administrativo, com foco em critérios de inscrição, provas e resultados, a Adenosina refere-se a um procedimento clínico de emergência, envolvendo aspectos farmacológicos, dosagem, contraindicações e efeitos adversos. Além disso, o primeiro é uma avaliação de caráter nacional e online, enquanto o segundo é um procedimento hospitalar que exige monitoramento contínuo durante a administração.\n\nEm síntese, ambos os temas ilustram a importância de procedimentos rigorosos, seja na educação ou na saúde, reforçando a necessidade de atenção aos detalhes, conformidade com normas e o compromisso com a segurança e a eficácia em suas respectivas áreas.",
      "type": "multiple",
      "documentIds": "[\"cdd04bfb-9b37-48a9-8114-a1689e416f32\",\"7b4fb0e4-1a7a-4862-8c00-01af53e2d9be\"]",
      "model": "gpt-4.1-nano",
      "tokensUsed": 1742,
      "processingTime": 13320,
      "method": "hierarchical",
      "createdAt": "2025-12-08T03:36:49.436Z",
      "updatedAt": "2025-12-08T03:36:49.436Z"
    },
    {
      "id": "7f52f3f3-3538-4a55-a691-f806d09abc58",
      "userId": "f699d9ec-c69f-4894-8616-146959a7a518",
      "title": "Summary of Adenosina.pdf",
      "content": "O documento apresenta o Formulário Terapêutico Distrital para a adenossina, um medicamento utilizado no tratamento de taquicardia paroxística supraventricular (TPSV), incluindo casos associados à síndrome de Wolff-Parkinson-White, com o objetivo de restaurar o ritmo sinusal. A adenossina é disponibilizada na apresentação de solução injetável de 3 mg/ml em ampola de 2 ml, de uso exclusivamente hospitalar, classificada como preparado cardíaco.\n\nAs contraindicações principais incluem bloqueio atrioventricular de segundo e terceiro graus (exceto em pacientes com marcapasso), doença do nó sinusal ou bradicardia sintomática (também com marcapasso), hipersensibilidade à droga e doenças pulmonares obstrutivas como asma. Sua administração é endovenosa, com dose inicial de 6 mg, podendo ser repetida com intervalos de 1 a 2 minutos, até o máximo de 12 mg por dose. A administração deve ser feita em bolus sem diluição, descartando-se qualquer quantidade não utilizada imediatamente, devido à ausência de conservantes.\n\nA farmacologia da adenossina revela ação rápida, com início imediato e meia-vida de aproximadamente 10 segundos, atuando hiperpolarizando tecidos atriais e retardando a condução pelo nó atrioventricular, o que favorece a reversão ao ritmo sinusal. Sua eliminação ocorre em até 10 segundos, e a droga é metabolizada em inosina, com potencial de interação com medicamentos como carbamazepina, digoxina, dipiridamol e metilxantinas (ex.: cafeína), podendo alterar sua eficácia ou aumentar riscos de efeitos adversos.\n\nEfeitos adversos graves incluem assistolia prolongada, fibrilação ventricular, bloqueios cardíacos, insuficiência cardíaca, infarto do miocárdio, além de broncoespasmo e parada respiratória. Efeitos comuns compreendem rubor facial, dispneia, náuseas, cefaleia, tontura e desconforto gastrointestinal. Recomenda-se cautela na administração em idosos, gestantes, lactantes e crianças menores de 50 kg, ajustando doses quando necessário, especialmente em pacientes transplantados de coração.\n\nO armazenamento deve ocorrer em temperatura entre 15°C e 30°C, sem refrigeração, devido ao risco de cristalização. A prescrição é restrita a receita médica hospitalar, com dispensação exclusiva em unidades hospitalares. Orientações ao profissional de saúde incluem administração rápida, monitoramento eletrocardiográfico e precauções em pacientes com histórico de convulsões ou disfunções hemodinâmicas. O documento é fundamentado em referências técnicas e normativas específicas, revisado por profissionais farmacêuticos e aprovado por autoridade competente.",
      "type": "single",
      "documentIds": "[\"09eed447-de58-40b3-9264-db14e6fb6c0a\"]",
      "model": "gpt-4.1-nano",
      "tokensUsed": 3421,
      "processingTime": 10648,
      "method": "stuff",
      "createdAt": "2025-12-10T11:40:47.459Z",
      "updatedAt": "2025-12-10T11:40:47.459Z"
    },
    {
      "id": "692b317f-0bb1-44d4-99dc-589883ed1125",
      "userId": "f699d9ec-c69f-4894-8616-146959a7a518",
      "title": "Summary of projeto_final.pdf",
      "content": "O documento apresenta o projeto de uma aplicação web para gerenciamento e análise de documentos PDF, com foco na geração de resumos utilizando modelos de linguagem de grande porte (LLM). O sistema possui funcionalidades completas, incluindo autenticação de usuários, upload seguro de arquivos (até 50 MB), visualização, e gerenciamento de documentos. Destaca-se a capacidade de gerar resumos individuais de um arquivo e resumos integrados de múltiplos documentos, com armazenamento e visualização desses resumos na interface principal (dashboard).\n\nA arquitetura técnica contempla um backend (possível em Python, Node.js ou Java) integrado a serviços de LLM (como OpenAI GPT ou Google Gemini) via APIs, além de um frontend responsivo (React, Vue.js ou Angular). Os dados dos usuários e metadados são armazenados em banco de dados seguro, com infraestrutura na AWS, incluindo VPC dedicada, instâncias EC2 e regras de segurança restritivas.\n\nOs critérios de aceitação garantem funcionalidades operacionais, como registro, login, upload, listagem, geração de resumos e navegação no dashboard, além de implantação adequada na AWS com configuração de rede e segurança. Os entregáveis incluem código completo, documentação técnica, instruções de instalação e um protótipo demonstrável. As métricas de sucesso priorizam tempos de resposta inferiores a 30 segundos para a geração de resumos, assegurando eficiência e desempenho do sistema.",
      "type": "single",
      "documentIds": "[\"bd176061-3189-4c16-8fd8-de77ea0f5f34\"]",
      "model": "gpt-4.1-nano",
      "tokensUsed": 1336,
      "processingTime": 6319,
      "method": "stuff",
      "createdAt": "2025-12-10T11:41:00.096Z",
      "updatedAt": "2025-12-10T11:41:00.096Z"
    },
    {
      "id": "f811cf79-42db-412c-b002-1d6d0a82e0a6",
      "userId": "f699d9ec-c69f-4894-8616-146959a7a518",
      "title": "Integrated Summary (2 documents)",
      "content": "O presente resumo integrado combina informações de dois documentos distintos, um referente ao formulário terapêutico do medicamento adenosina (Documento 1) e outro descrevendo uma aplicação web para gerenciamento e síntese de documentos (Documento 2). A seguir, são destacados os temas comuns, conexões, diferenças e uma narrativa coerente que sintetiza as principais informações de ambos.\n\n**Temas comuns e conexões:**\n\n1. **Tecnologia e Informação**: Ambos os documentos abordam o uso de tecnologias específicas para melhorar processos — no caso do medicamento, a tecnologia farmacêutica e clínica; na aplicação web, o uso de modelos de linguagem (LLMs) para processamento de textos. Ambos enfatizam a importância de sistemas bem estruturados para garantir segurança, eficiência e precisão (Documento 1: segurança na administração do medicamento; Documento 2: segurança na gestão de dados e acessos).\n\n2. **Segurança e Precauções**: No âmbito farmacêutico, o adenosina apresenta contraindicações, efeitos adversos graves e recomendações de precaução, especialmente em populações vulneráveis (Documento 1). De forma semelhante, a aplicação web destaca critérios de segurança na infraestrutura, controle de acesso e proteção de dados (Documento 2).\n\n3. **Procedimentos e Protocolos**: Ambos os documentos descrevem protocolos específicos — o farmacêutico detalha a administração, dosagem, interações e cuidados na utilização do medicamento, enquanto a aplicação define fluxos de trabalho, validações e critérios de aceitação para garantir a funcionalidade e confiabilidade do sistema.\n\n**Diferenças ou contradições importantes:**\n\n- O Documento 1 é técnico e clínico, focado em aspectos farmacológicos, indicações, contraindicações, efeitos adversos e orientações para o uso do adenosina, enquanto o Documento 2 é voltado ao desenvolvimento de uma ferramenta digital, com foco em requisitos técnicos, segurança da informação e usabilidade.\n\n- Não há contradições explícitas entre os documentos, pois eles tratam de áreas distintas (saúde clínica versus tecnologia da informação). Contudo, ambos ressaltam a necessidade de rigor e controle — na administração do medicamento e na implementação do sistema digital.\n\n**Narrativa integrada:**\n\nA gestão eficiente de informações e recursos é fundamental tanto na área da saúde quanto na tecnologia. No contexto farmacêutico, o uso do adenosina como tratamento para taquicardia paroxística supraventricular exige protocolos rigorosos de administração, atenção às contraindicações, efeitos adversos e precauções especiais, especialmente em populações vulneráveis, garantindo a segurança do paciente (Documento 1). Essa abordagem detalhada reflete a importância de sistemas bem estruturados para a prescrição, armazenamento e uso do medicamento, minimizando riscos e promovendo a eficácia do tratamento.\n\nParalelamente, na esfera tecnológica, o desenvolvimento de uma aplicação web para gerenciamento e síntese de documentos PDF demonstra a necessidade de sistemas seguros, confiáveis e eficientes, capazes de lidar com dados sensíveis e fornecer resultados rápidos e precisos. A aplicação incorpora funcionalidades de autenticação, gerenciamento de arquivos, integração com modelos de linguagem (LLMs) e infraestrutura na nuvem, com critérios de aceitação que asseguram sua operacionalidade e segurança (Documento 2).\n\nAmbos os contextos evidenciam a importância de protocolos bem definidos, controle de acesso e atenção às especificidades de cada área — seja na administração de medicamentos ou na implementação de sistemas digitais. Assim, a integração dessas abordagens reforça a necessidade de rigor, segurança e inovação para promover melhores resultados, seja na saúde ou na tecnologia da informação.",
      "type": "multiple",
      "documentIds": "[\"09eed447-de58-40b3-9264-db14e6fb6c0a\",\"bd176061-3189-4c16-8fd8-de77ea0f5f34\"]",
      "model": "gpt-4.1-nano",
      "tokensUsed": 4708,
      "processingTime": 6570,
      "method": "stuff",
      "createdAt": "2025-12-10T11:41:19.400Z",
      "updatedAt": "2025-12-10T11:41:19.400Z"
    },
    {
      "id": "07aa012f-a62b-4201-9ffa-4e0a2cc26625",
      "userId": "f699d9ec-c69f-4894-8616-146959a7a518",
      "title": "Summary of Claude-Estrutura do projeto e implementaÃ§Ã£o local.pdf",
      "content": "O projeto Sistema de Gerenciamento Multimídia (SGM) encontra-se em estágio avançado de desenvolvimento, com a maioria das funcionalidades principais já implementadas. A estrutura do projeto inclui um backend em Node.js com Express, conexão a banco de dados PostgreSQL, armazenamento em S3, autenticação JWT, gerenciamento de perfis, upload e listagem de mídias, geração de thumbnails, filtros, paginação e exclusão de mídias. O frontend, composto por HTML, CSS e JavaScript, possui páginas de login, cadastro, perfil e dashboard, além de funcionalidades de upload, visualização e filtros.\n\nAs funcionalidades pendentes, de maior prioridade, envolvem a implementação de tags para categorização de mídias, extração de metadados detalhados (dimensões, duração, resolução, bitrate, etc.), processamento de vídeos em múltiplas qualidades (1080p, 720p, 480p), pesquisa avançada por descrição e tags, além de visualizações completas com modais e players dedicados para diferentes tipos de mídia.\n\nPara isso, foram planejadas e criadas diversas atualizações nos modelos (adicionando campos como tags, metadata, gênero e versões de vídeo), utilitários de extração de metadados, processadores assíncronos de vídeo, controllers e rotas atualizadas, além de melhorias no frontend com modais, campos adicionais e suporte à seleção de qualidade de vídeo.\n\nTambém foram configurados suportes para testes locais com SQLite, além de ajustes na infraestrutura de armazenamento S3, scripts de instalação, arquivos de configuração (.env), e scripts de setup. A estrutura do projeto foi reorganizada para facilitar testes locais e implantação, incluindo a cópia de arquivos frontend para a raiz do projeto e ajustes no servidor para servir os arquivos corretamente.\n\nO próximo passo envolve a implementação das funcionalidades pendentes de maior prioridade, testes locais, e finalização da integração entre backend e frontend, garantindo uma plataforma completa, robusta e de fácil teste e uso.",
      "type": "single",
      "documentIds": "[\"76553d70-ec82-4677-9fb0-d2ef7d383e5f\"]",
      "model": "gpt-4.1-nano",
      "tokensUsed": 4669,
      "processingTime": 7554,
      "method": "stuff",
      "createdAt": "2025-12-10T11:56:44.930Z",
      "updatedAt": "2025-12-10T11:56:44.930Z"
    }
  ]
}